{
    "metadata": {
        "genresTotal": [
            "Fiction",
            "Women's Fiction",
            "Mystery",
            "Psychological Suspense",
            "Psychological Thriller",
            "Suspense",
            "Thriller",
            "Biography",
            "Nonfiction",
            "Sports",
            "Literary Criticism",
            "Memoir",
            "Magical Realism",
            "Gender Studies",
            "Historical Fiction",
            "Historical Mystery",
            "Fantasy",
            "Historical Fantasy",
            "Historical Romance",
            "Romance",
            "History",
            "Social Sciences",
            "Essays",
            "Humor",
            "Historical Thriller",
            "Gothic",
            "Horror",
            "True Crime"
        ]
    },
    "books": [
        {
            "title": "A Forty Year Kiss",
            "author": "Nickolas Butler",
            "id": 13837409967763393215,
            "genres": [
                "Fiction",
                "Women's Fiction"
            ],
            "review": " Nickolas Butler, the critically acclaimed author of SHOTGUN LOVESONGS, returns with A FORTY YEAR KISS, a beautiful, life-affirming novel about second chances and sunset triumph. Featuring a sixty-something couple giving love another try as they revisit their youth, the book will appeal to any reader in need of a love story for the ages. When we meet Charlie, he is 64 years old and nursing a beer in a bar as he waits for his date to arrive. It’s not exactly the future he had planned. Married at 20 and two more times since then, Charlie never expected to be having butterflies as he waits for a love match to find him. But even more surprising than being single at 60 is the identity of his date: his ex-wife, Vivian. Married for four years in their early 20s, Charlie and Vivian divorced for a number of reasons, but they all come back to one: Charlie’s drinking, a bad habit with which he continues to struggle. But unlike the Charlie of 40 years ago, this Charlie at least knows he has a problem. He’s determined to bury it once and for all so that he can love Vivian the way he was meant to: totally, completely and endlessly. It’s a real “wish upon a star” kind of dream, but he is ready to do whatever it takes to earn her trust again, even if it means laying all of his cards on the table. \"This truly is a literary valentine that will appeal to readers from all walks of life and ages.... Perfect for book clubs, A FORTY YEAR KISS is dazzling in its lyricism and poignant in its takeaways.\" Of course, 40 years isn’t a small amount of time, and while Charlie has been busy getting married and divorced and nursing his heartbreaks with alcohol, Vivian also has moved on. Married only one more time after Charlie, Vivian is now the single mother of Jessie and Melissa, and grandmother to Melissa’s two girls, Ainsley and Addison. Jessie lives in a group home, so Vivian resides with Melissa and her daughters, fully immersing herself in all the pleasures and delights of grandmotherhood. Looking back, Vivian wouldn’t change the trajectory of her life for anything --- not when she has two beloved, adorable granddaughters to show for it --- but even she can admit that she hasn’t always been happy and her current life can sometimes feel a bit smothering. Simply put, it has been a long time since anyone really treasured her or was simply nice to her. So when she receives a message from her ex-husband, she doesn’t think twice. What’s wrong with grabbing a drink with an old friend? Charlie is quick to admit the real reason he returned to their small town after a near lifetime of working on trains: he is in love with Vivian and wants them to try to make it work again. Vivian is touched, even flattered by Charlie’s zeal, and she can’t deny that he certainly seems different: more focused and responsible, and less reactionary. But she also can’t ignore the fact that she’s grown very accustomed to her independence. Where she once cowered from her husband’s outbursts, she is now much more comfortable having outbursts of her own, standing up for herself, and maintaining the boundaries she so carefully has built up after a lifetime of hurt. Rather than being turned off by this new, more confident Vivian, Charlie is entranced. This, he thinks, is the Vivian he always loved, the one he knew was hiding behind her unflappable exterior as he drank their life and love story away. With Charlie and Vivian committed to at least trying again, a few painful truths come to the forefront. First, Vivian has been hiding a secret from Charlie for 40 years, one that not only could threaten their reunion, but could change his life forever. Second, falling in love and agreeing to marry when you’re young is one thing --- naivety comes with blinders, after all --- but doing the same thing at 60 is unbelievable, radical even. Both are set in their ways and routines, and blending their lives --- and those of Vivian’s daughters and granddaughters --- comes with much higher stakes than it did when they were just two dumb kids in love. Add to that Charlie’s alcoholism, and you have not just a love story, but a love battle, the ultimate fight for true love in all its iterations. With Charlie and Vivian confronting their pasts --- both shared and individual --- it will take many painful discussions, a lot of uncomfortable truths, and some serious reckoning with redemption for them to usher in and revive their love. Fortunately, with Nickolas Butler at the writing helm, A FORTY YEAR KISS does just that. This truly is a literary valentine that will appeal to readers from all walks of life and ages. Although it’s a tender and compassionate tale, Butler is never overly sentimental or mawkish, choosing instead to let his characters’ burdens and backstories ground the otherwise romantic plot and give it some real literary heft and muscle. Far from diluting the love story, this choice actually helps the romance between Charlie and Vivian come to life, almost turning it into a third character, the underdog you really root for. Although Charlie and Vivian are the stars of this tale, I was equally if not more charmed by Melissa and her interactions with Charlie. Despite the fact that Charlie has never fathered children or created a real family, his ability to adapt to and even rescue Vivian’s daughter from herself is proof of his total redemption. It makes Vivian’s love for him --- despite his flaws --- gritty and real, but also soaring and romantic. Perfect for book clubs, A FORTY YEAR KISS is dazzling in its lyricism and poignant in its takeaways. Reviewed by Rebecca Munro on February 7, 2025",
            "mood": null
        },
        {
            "title": "A Killing Cold",
            "author": "Kate Alice Marshall",
            "id": 9744628309393724226,
            "genres": [
                "Fiction",
                "Mystery",
                "Psychological Suspense",
                "Psychological Thriller",
                "Suspense",
                "Thriller"
            ],
            "review": " Not too long ago, Kate Alice Marshall made the transition from YA to adult fiction and has not looked back. Her latest release, A KILLING COLD, brings more of what her readers have come to expect in the form of psychological thrills full of plot twists. Assistant bookstore manager Theodora Scott was over the moon when she met Connor Dalton through a mutual friend six months ago. However, her fears will be put to the test when he suggests taking her to Idlewood, his family’s isolated winter retreat in the snowy mountains. It’s not that Theo is concerned about not living up to the Daltons’ expectations; she’s worried that they’ll find out who she really is. \"If this starts to feel like an Agatha Christie mystery, you would not be too far off the mark. A KILLING COLD will keep your head spinning and mind guessing right through to the final act.\" Theo never told Connor that she did not know her birth parents and that her adoptive parents basically tuned her out after accusing her of being the devil’s spawn. This certainly is not the best family background to make a first impression! Even though the reader is aware of this information early on in the novel, it never takes away from the suspense as nearly all of the characters seem to have something to hide and secrets they will fight valiantly to keep private. To make matters worse, Theo started receiving texts from an anonymous sender a few weeks prior to this trip with messages like “Stay away from Connor Dalton.” It is interesting to see Theo waver between keeping her own secrets from being unearthed and trying to dig into the Dalton family to find out why someone is trying to scare her away from them. It becomes rather obvious that something is going on when the first person they meet at Idlewood, Connor’s older sister, Lexie, pries him away for a private chat. The only piece of advice that Connor gave Theo was to win over their matriarch, Grandma Louise, and everyone else would follow suit. She is indeed a tough cookie, and Theo can’t help but feel judged by each member of the family and household staff she meets. There is also another secret that Theo has kept to herself --- the nightmare she has had for decades involving weird symbolism and a man with antlers. She gets a chill up her spine when she finds a photo of Connor’s late father holding a small girl. That child is Theo before she was adopted and began her new life. From this point on, all bets are off. Theo realizes that the looks she has received may have involved a bit of recognition of her true identity and how it might tie into their patriarch. Even Connor proves to be somewhat different from what Theo believed him to be, and that’s when the claustrophobic feeling of cold isolation really begins to set in. Theo needs to remove herself from this place and situation but is unable to do so as everyone is snowed in. If this starts to feel like an Agatha Christie mystery, you would not be too far off the mark. A KILLING COLD will keep your head spinning and mind guessing right through to the final act. Reviewed by Ray Palen on February 15, 2025",
            "mood": null
        },
        {
            "title": "A Long Time Gone",
            "author": "Joshua Moehling",
            "id": 9195561666666994094,
            "genres": [
                "Fiction",
                "Mystery",
                "Suspense",
                "Thriller"
            ],
            "review": " A LONG TIME GONE is perhaps the most personal story in Joshua Moehling’s series starring Deputy Ben Packard, who already made a splash as an openly gay lead character. This time, it is not his sexuality that takes center stage, but his family’s haunted past. After losing the local sheriff’s race, Packard is dealing with the harsh reality that he now has to report to his hated rival as he is demoted to the position of bag check scanner at the courthouse. Trouble always seems to find Packard, and his latest stint is no exception. He is on duty when one of the parties in a heated case presents a weapon, and he is forced to fire, killing Robert Clark before he can get off a third shot. Now on administrative leave while the shooting is being investigated, Packard is thrust back into his past and must deal with wounds that have never healed. \"Joshua Moehling is officially a force to be reckoned with, and A LONG TIME GONE proudly continues one of the best written mystery/thriller series on the market.\" When he was just a boy, Packard’s older brother, Nick, walked out the back door of their home never to be seen or heard from again. He had been declared dead decades ago, but Packard and his family never recovered from the incident and experienced no closure. Suddenly new information arises that may indicate the location of Nick’s body. This brings Packard’s estranged mother back into town. They are both surprised to find that the woman who bought their old home recently died in a household accident when she was found on the floor with a broken neck. The death appeared to be suspicious, and Packard finds himself rooted in two separate but possibly related tragedies. Something as innocent as a photograph of Nick swimming in a nearby lake with two old friends sets Packard off on a hunt for answers. However, everyone he encounters who may have been around Nick the summer he disappeared comes across as untrustworthy and unnecessarily elusive. As frustrating as this is, he is not swayed in his efforts to learn the truth, and the novel’s pace really picks up when he delves deeper into his past. The relationship between Packard and his mother is both stereotypical and comical, making for some welcome lighthearted moments amidst all of the darkness that the narrative brings. Joshua Moehling is officially a force to be reckoned with, and A LONG TIME GONE proudly continues one of the best written mystery/thriller series on the market. Reviewed by Ray Palen on February 7, 2025",
            "mood": null
        },
        {
            "title": "A Season of Light",
            "author": "Julie Iromuanya",
            "id": 10463019118077160389,
            "genres": [
                "Fiction",
                "Women's Fiction"
            ],
            "review": " For fans of BEHOLD THE DREAMERS comes a compelling novel about a tightly bound Nigerian family living in Florida and the wounds that get passed down from generation to generation, from the author of the acclaimed MR. AND MRS. DOCTOR. When 276 schoolgirls are abducted from their school in Nigeria, Fidelis Ewerike, a Florida-based barrister, poet and former POW of the Nigerian Civil War, begins to go mad, consumed by memories of his younger sister, Ugochi, who went missing during that conflict. Consumed by survivor’s guilt and fearful that the same fate awaits Amara, his 16-year-old daughter who bears an uncanny resemblance to Ugochi, Fidelis locks her in her bedroom, offering no words of explanation, only lovingly --- if poorly --- made meals and sweets. Amid that singular action, the Ewerike family spirals into chaos. After unsuccessful attempts to free her daughter from her room, his wife, Adaobi, seeks the counsel of a preacher, praying for spiritual liberation from the curse she is certain has plagued her family since leaving Nigeria. Fourteen-year-old Chuk, beset by his own war with the neighborhood boys, receives a painful education on force, masculinity, and his tenuous position within his family. And rebellious, resentful Amara is hungry for her life to be hers, so the moment she is able to escape her imprisonment, she falls in love --- not with the Aba-born engineer-in-training her mother envisages, but with Maksym Kostyk, the son of the town drunk. Before long, the two have concocted a plan to run away from the trappings of their familial traumas. Perfect for readers of SING, UNBURIED, SING, Julie Iromuanya's A SEASON OF LIGHT is an all-consuming masterpiece. To peer into the window of the Ewerike family’s lives is a gift.",
            "mood": null
        },
        {
            "title": "A Time for Reflection: The Parallel Legacies of Baseball Icons Willie McCovey and Billy Williams",
            "author": "Jason Cannon",
            "id": 7058603136208478300,
            "genres": [
                "Biography",
                "Nonfiction",
                "Sports"
            ],
            "review": " If you love sports, you probably have one that you prefer over the others. For me it is baseball, which I first enjoyed in the early 1950s when I sat in the right field bleachers of Wrigley Field as the Chicago Cubs played the Brooklyn Dodgers. In many respects, following a baseball season is like reading a novel. The story unfolds over some length of time, each day bringing new elements into the plot that ultimately will evolve into the postseason and the World Series. Just as in an exciting work of literature, you will encounter twists, turns, surprises, happiness and sadness. Perhaps because it is the longest of sports seasons (and it seems to get longer every year) and it offers so many unique occurrences, baseball is a game of memories for a lifetime. Even today, I still recall events that I witnessed live at baseball games in the ’60s and ’70s. In A TIME FOR REFLECTION, Jason Cannon celebrates the lives and careers of two baseball icons: Hall of Famers Willie McCovey and Billy Williams. \"Willie McCovey and Billy Williams were humble and kind men whose stories are wonderfully told in this exceptional biography.\" As a member of the San Francisco Giants, McCovey hit more than 500 home runs and was voted Most Valuable Player in the National League in 1969. He and Willie Mays dominated the Giants lineup in the ’60s. Ironically, McCovey may be best known for making the final out of the 1962 World Series. With two runners on and the Yankees ahead 1-0 in the bottom of the ninth, McCovey smashed a line drive that was caught by Yankees second baseman Bobby Richardson. Inches either way, and the Giants would have won the World Series. Williams never made it to the World Series as he spent most of his career with the Chicago Cubs. The National League Rookie of the Year in 1961, he was a consistent .300 hitter and run producer for the Cubs. From 1963 to 1970, he played 1,117 consecutive games, a National League record that stayed intact until 1983. Cannon does a remarkable job of researching and putting into words the numerous achievements of McCovey and Williams. He benefited from interviewing many of their teammates, who willingly talked about their contributions to baseball as well as the adopted communities of San Francisco and Chicago. But the story truly begins in Mobile, Alabama, in 1938. The McCovey and Williams families experienced the evils of the segregated South and the economic struggles of the era. Both men grew up in strong families where hard work and Sunday church attendance were the rules. They would develop their baseball skills playing with Black teams made up of players who were many years older than them. When McCovey and Williams were nine years old, their world suddenly changed. The Brooklyn Dodgers signed Jackie Robinson in 1947, and Major League Baseball became a dream for every young player regardless of race. By the time McCovey was old enough for a professional contract, the Giants were actively scouting and recruiting Black players. At the age of 17, he traveled to a tryout camp and was signed by the Giants, who were still playing in New York. There he met Orlando Cepeda, who would be a teammate and lifelong friend. Both had very brief minor league careers, and by 1959 they were playing for the San Francisco Giants. As a teenager, Williams barnstormed with Black professional players, including Satchell Paige. In 1956, he signed with the Chicago Cubs for $200 a month and a bus ticket. He became a full-time major leaguer just five years later. A TIME FOR REFLECTION clearly recounts the racism that both players experienced. In the Texas League, they could not travel to games in Louisiana because state law prohibited mixed-race athletic contests. In other states, they stayed in separate hotels and ate in different restaurants than their teammates. At one point, Williams almost quit. But he was convinced by Buck O’Neil, who would become the first Black coach in the major leagues, to stay the course. Willie McCovey and Billy Williams were humble and kind men whose stories are wonderfully told in this exceptional biography. Reviewed by Stuart Shiffman on February 14, 2025",
            "mood": null
        },
        {
            "title": "Bibliophobia: A Memoir",
            "author": "Sarah Chihaya",
            "id": 1624126965228480700,
            "genres": [
                "Literary Criticism",
                "Memoir",
                "Nonfiction"
            ],
            "review": " In much the same way that writers and would-be writers are drawn to well-written accounts of other writers' processes and philosophies, as a voracious lifelong reader, I've always been fascinated by the attempts of others to understand how and why we read. I'm not talking about the science of how we acquire the ability to read --- though that also is an interesting topic --- but rather the intellectual pursuit of what draws us to read for pleasure, knowledge or connection, and how what we read shapes who we are. For that reason, despite or perhaps because of its provocative title, I was immediately drawn to BIBLIOPHOBIA. Best known as a literary critic and co-author of THE FERRANTE LETTERS, Sarah Chihaya opens her unusual memoir with a chapter also entitled \"Bibliophobia\" that explains the origins of the book's title. Here she begins to describe (though the most harrowing details are revealed later on) the mental breakdown that resulted in her hospitalization. As she explains, this breakdown always felt inevitable to her: \"It wasn't a surprise that I ended up in the hospital. The main surprise was how long it took me to get there.\" \"Some sections of BIBLIOPHOBIA come as close as anything I've read to describing some of the phenomenon of losing oneself in a book... BIBLIOPHOBIA is rich, complex and rewarding, as the very best reading should be.\" So for Chihaya, the most troubling aspect of her breakdown was not that it happened at all, but that it was accompanied by a truly disturbing side effect: she became profoundly disinterested in reading. \"Reading was my whole life, whether I liked it or not: My work life and my home life were built around reading, my physical space constructed by walls of books. All of them were useless to me now, and, looking at them, I felt nauseous.\" The balance of that opening chapter begins to trace the roots of her acute bibliophobia and also follows her as she finds, with the help of her friend and a particularly forceful book recommendation, her way out of it. Subsequent chapters delve into Chihaya's personal history as it intersects with specific books. This sounds like a rather superficial or simplistic way to structure a memoir, but I assure you that this surface description is not doing it justice. In these sections, she touches not only on the books themselves and where she was in her life when she first encountered them, but on a multitude of other topics that --- much like the process of being a lifelong reader --- spiral out from this center in intricate and intriguing ways. In a chapter on L.M. Montgomery's Anne of Green Gables series, for example, Chihaya reflects not only on her own youthful reading habits, but on her country of origin (Canada) and her cultural heritage (Japanese). She ruminates about tidy narratives and if the stories we tell about ourselves are as carefully crafted as the novels we read. In addition, she reveals her early suicide attempts and reflects on Montgomery's own likely suicide. Some sections of BIBLIOPHOBIA come as close as anything I've read to describing some of the phenomenon of losing oneself in a book, and what that phrase even means when you think about it seriously: \"I didn't go to books to be a heroine. I went to books because I wanted to be --- nothing, nobody. I wanted nothing so much as to be a kind of sociable air, circulating invisibly in the room, necessary but never noticed.\" In most cases, later chapters focus largely on individual books (such as A.S. Byatt's POSSESSION or Toni Morrison's THE BLUEST EYE). But each carefully wrought chapter also introduces a host of other references and considerations, not to mention insights into Chihaya's own story, finally circling back to the events leading up to that breakdown. Inveterate readers will appreciate that Chihaya opens the volume with a comprehensive list of all the books considered within. Initially, the memoir can read like a series of personal essays on a common theme, but these chapters do gradually build on one another, as Chihaya's story becomes the narrative of her lifelong quest to find the book that will save her --- and her realization of the impossibility of that pursuit. BIBLIOPHOBIA is rich, complex and rewarding, as the very best reading should be. Reviewed by Norah Piehl on February 7, 2025",
            "mood": null
        },
        {
            "title": "Black Woods, Blue Sky",
            "author": "Eowyn Ivey",
            "id": 1593846214277935752,
            "genres": [
                "Fiction",
                "Magical Realism"
            ],
            "review": " Eowyn Ivey, the Pulitzer Prize finalist and New York Times bestselling author of THE SNOW CHILD,  returns to the mythical landscapes of Alaska with an unforgettable dark fairy tale that asks the question: Can love save us from ourselves? Birdie is keeping it together; of course she is. So she’s a little hungover, sometimes, and she has to bring her daughter, Emaleen, to her job waiting tables at an Alaskan roadside lodge, but she’s getting by as a single mother in a tough town. Still, Birdie can remember happier times from her youth, when she was free in the wilds of nature. Arthur Neilsen, a soft-spoken and scarred recluse who appears in town only at the change of seasons, brings Emaleen back to safety when she gets lost in the woods. Most people avoid him, but to Birdie, he represents everything she’s ever longed for. She finds herself falling for Arthur and the land he knows so well. Against the warnings of those who care about them, Birdie and Emaleen move to his isolated cabin in the mountains, on the far side of the Wolverine River. It’s just the three of them in the vast black woods, far from roads, telephones, electricity and outside contact, but Birdie believes she has come prepared. At first, it’s idyllic and she can picture a happily ever after: Together they catch salmon, pick berries, and climb mountains so tall it’s as if they could touch the bright blue sky. But soon Birdie discovers that Arthur is something much more mysterious and dangerous than she ever could have imagined and that like the Alaska wilderness, a fairy tale can be as dark as it is beautiful. BLACK WOODS, BLUE SKY is a novel with life-and-death stakes, about the love between a mother and daughter, and the allure of a wild life --- about what we gain and what it might cost us.",
            "mood": null
        },
        {
            "title": "Bonded in Death",
            "author": "J. D. Robb",
            "id": 9385209155942242082,
            "genres": [
                "Fiction",
                "Mystery",
                "Suspense",
                "Thriller"
            ],
            "review": " BONDED IN DEATH, the 60th book in J.D. Robb’s futuristic police procedural series, is one of her smartest and most enthralling thrillers. It delves into personal themes such as loyalty, honor and betrayal while also delivering a tense and suspenseful read. Lieutenant Eve Dallas of the Homicide Division of the New York Police and Security Department is called to the scene of an elderly man who was found dead in a car and holding a business card that bears her name. The death is suspicious, and the card is an obvious fake, but Eve needs to know how she is connected to this crime. \"BONDED IN DEATH is a touching, thrilling and clever story that you will not want to put down for a minute.\" The deceased, Giovanni Rossi, recently arrived in New York City from Rome to keep an oath he made. Unfortunately, his widow in Italy has nothing more to offer. As usual, Eve brings her work home and creates a murder board, hoping that her husband, Roarke, can help her make sense of the evidence she has so far. She also believes that Summerset, Roarke’s surrogate father and their household manager, will have some particular insights. He was in Europe during the Urban Wars of the 2020s and may be able to offer some information about the murder victim. When Summerset sees Giovanni’s photo, he pales in shock. He recognizes the man as Wasp, a member of an elite undercover organization that he joined while serving as a medic during the wars. Summerset has always been hesitant to talk about that time in his life, but his experiences with the group are essential to Eve’s investigation. With the help of her team, Eve interviews the surviving members of The Twelve. What they learn takes them down a trail of twists and turns that leads across international boundaries. With the cooperation of Interpol and other foreign agencies, they discover a complex web of deception and subterfuge that reveals a killer who is desperate for revenge. Eve embarks on a high-risk mission to thwart a kidnapping plot and another potential murder, culminating in a cunning interrogation scene that serves as the novel’s dramatic climax. Eve, Roarke and Summerset are quite the team here. Summerset always has been an important person in Roarke’s life. Despite their strong personalities, Eve and Summerset have tolerated each other as they have one thing in common: their love for Roarke. However, as the investigation evolves, Eve’s relationship with Summerset deepens as she works to protect and honor his past and present life while bringing the murderer to justice. BONDED IN DEATH is a touching, thrilling and clever story that you will not want to put down for a minute. Reviewed by Jennifer McCord on February 21, 2025",
            "mood": null
        },
        {
            "title": "Cleavage: Men, Women, and the Space Between Us",
            "author": "Jennifer Finney Boylan",
            "id": 1934600469907381920,
            "genres": [
                "Gender Studies",
                "Memoir",
                "Nonfiction"
            ],
            "review": " What is the difference between men and women? Jennifer Finney Boylan, the bestselling author of SHE'S NOT THERE and co-author of MAD HONEY with Jodi Picoult, examines the divisions --- as well as the common ground --- between the genders and reflects on her own experiences, both difficult and joyful, as a transgender American. SHE'S NOT THERE was the first bestselling work written by a transgender American. Since its publication 20 years ago, Jennifer Finney Boylan has become the go-to person for insight into the impact of gender on our lives --- from the food we eat to the dreams we dream, both for ourselves and for our children. But CLEAVAGE is more than a deep dive into gender identity; it’s also a look at the difference between coming out as trans in 2000 --- when many people reacted to Boylan’s transition with love --- and the present era of blowback and fear. How does gender affect our sense of self? Our body image? The passage of time? The friends we lose --- and keep? Boylan considers her womanhood, reflects on the boys and men who shaped her, and reconceives of herself as a writer, activist, parent and spouse. With heart-wrenching honesty, she illustrates the feeling of liminality that followed her to adulthood, but demonstrates the redemptive power of love through it all. With Boylan’s trademark humor and poignancy, CLEAVAGE is a sharp, witty and captivating look at the triumphs and losses of a life lived in two genders. It provides hope for a future in which we all have the freedom to live joyfully as men, as women and in the space between us.",
            "mood": null
        },
        {
            "title": "Dead in the Frame: A Pentecost and Parker Mystery",
            "author": "Stephen Spotswood",
            "id": 4939343714016591265,
            "genres": [
                "Fiction",
                "Historical Fiction",
                "Historical Mystery",
                "Mystery"
            ],
            "review": " The most dramatic installment yet in the Nero Award–winning Pentecost and Parker series, as Will scrambles to solve a shocking murder before Lillian takes the fall for the crime. New York City, 1947: Wealthy financier and ghoulish connoisseur of crime Jessup Quincannon is dead, and famed detective Lillian Pentecost is under arrest for his murder. Means, motive and a mountain of evidence leave everyone believing she’s guilty. Everyone, that is, except Willowjean “Will” Parker, who knows for a fact her boss is innocent. She just doesn’t know if she can prove it. With Lillian locked away in the House of D --- New York City’s infamous women’s prison --- Will is left to root out the real killer. Was it a member of Quincannon’s murder-obsessed Black Museum Club? Maybe it was his jilted lover? Or his beautiful, certainly-sociopathic bodyguard? And what about the mob hit-man who just happened to disappear after the shots were fired? With the city barreling toward the trial of the century, each day brings fresh headlines and hints of long-buried scandals from Lillian’s past. Will is desperate to get her boss out from behind bars before her reputation is destroyed. Because the House of D is no kind place, especially for a woman with multiple sclerosis. Or one with so many enemies. Her health failing and being targeted by someone who wants her dead, Lillian needs to survive long enough to take the stand. With time running out on both sides of the prison walls, Will and Lillian must wager everything to uncover who put their thumb on the scales and a bullet in Quincannon’s head. Before Lady Justice brings her sword down, ending Pentecost and Parker's adventures once and for all.",
            "mood": null
        },
        {
            "title": "Gliff",
            "author": "Ali Smith",
            "id": 2893673628437101925,
            "genres": [
                "Fiction",
                "Women's Fiction"
            ],
            "review": " It’s rare for a literary novelist to be as skilled as Ali Smith is at responding --- sometimes, it seems, at lightning speed --- to current political realities. Her Seasonal Quartet novels (actually more of a quintet with the addition of COMPANION PIECE), published in quick succession between 2016 and 2021, seemed to be responding, as if in real time, to the unfolding realities of Brexit. Now, in GLIFF, Smith brings readers a story of two siblings who are navigating a near-future Britain, the outlines of which feel all too relatable. The book opens with the children --- Briar, who’s nonbinary, and their younger sister, Rose --- and their mother’s boyfriend, Leif, bidding farewell to their mother outside a hotel. She plans to work there for a couple of weeks, standing in for her ill sister. \"GLIFF is a mysterious, satisfying novel in its own right. But a companion volume, GLYPH...comes out next year. Readers will look forward to putting together the puzzle.\" The family has been summarily evicted from their home --- an event signaled by a red line that’s been painted around their row house (at the behest of their next-door neighbors, who didn’t like the house blocking their view). Having moved into a camper van, Leif and the children awake to discover a red line encircling that as well. So they secretly decamp to an abandoned house belonging to a friend. Having settled Briar and Rose with a quantity of canned food, Leif leaves, heading back to the city --- temporarily, he promises --- to retrieve their mother. In Leif’s absence, Rose becomes enamored of the horses that graze nearby (only growing more obsessed after Briar explains what an “abattoir horse” is). The children use all of their cash to purchase one from Colon, the young son of the landowner, and Rose names the horse Gliff. There’s a lot about names in GLIFF, a phenomenon that won’t be too surprising to those who have read Smith’s prior work, which is often filled with linguistic playfulness and the breaking apart of words (including names). Briar provides a different name to each new acquaintance --- a form of chameleon-like impermanence that also may mirror their gender identity. At first, Briar thinks “Gliff” is just a nonsense word, a sound that Rose chooses on a whim. Later on, however, Briar uses a dictionary to discover a more than page-long list of definitions for the word, including “a substitute word for any word” and “the twinkling of an eye.” Portions of the book --- when the siblings are homesteading and meeting the horses, and when Briar encounters a secret communal living space housed in a shuttered school, not to mention a particularly memorable fable featuring a tyrant with a gold toilet --- feel somewhat out of time. But this is very much a novel of our times, specifically an uncomfortably near future, where electronic surveillance is omnipresent and people are in danger of disappearing once they’re declared “unverified”: “One person here had been unverified for saying out loud that a war was a war when it wasn’t permitted to call it a war. Another had found herself declared unverifiable for writing online that the killing of many people by another people was a genocide.” Given this hazardous climate and the siblings’ absence of guardians, it’s perhaps inevitable that they grow separated. Less predictable is where Briar finds themself five years later, or the harrowing process they undergo to get there. When a figure from their past shows up at the factory where they work as a supervisor (overseeing staggeringly dangerous working conditions), Briar’s past and present mingle, and they find a kind of courage foreshadowed in their own family history. GLIFF is a mysterious, satisfying novel in its own right. But a companion volume, GLYPH, which (in much the same way that the Seasonal Quartet books complemented one another) promises to “tell a story hidden in the first novel,” comes out next year. Readers will look forward to putting together the puzzle. Reviewed by Norah Piehl on February 15, 2025",
            "mood": null
        },
        {
            "title": "Harlem Rhapsody",
            "author": "Victoria Christopher Murray",
            "id": 16777454917041893690,
            "genres": [
                "Fiction",
                "Historical Fiction",
                "Women's Fiction"
            ],
            "review": " She found the literary voices that would inspire the world. The extraordinary story of the woman who ignited the Harlem Renaissance, written by Victoria Christopher Murray, the New York Times bestselling coauthor of THE PERSONAL LIBRARIAN. In 1919, a high school teacher from Washington, D.C arrives in Harlem excited to realize her lifelong dream. Jessie Redmon Fauset has been named the literary editor of The Crisis. The first Black woman to hold this position at a preeminent Negro magazine, Jessie is poised to achieve literary greatness. But she holds a secret that jeopardizes it all. W. E. B. Du Bois, the founder of The Crisis, is not only Jessie’s boss, he’s her lover. And neither his wife nor their 14-year age difference can keep the two apart. Amidst rumors of their tumultuous affair, Jessie is determined to prove herself. She attacks the challenge of discovering young writers with fervor, finding 16-year-old Countee Cullen, 17-year-old Langston Hughes, and Nella Larsen, who becomes one of her best friends. Under Jessie’s leadership, The Crisis thrives. Every African American writer in the country wants their work published there. When her first novel is released to great acclaim, it’s clear that Jessie is at the heart of a renaissance in Black music, theater and the arts. She has shaped a generation of literary legends, but as she strives to preserve her legacy, she’ll discover the high cost of her unparalleled success.",
            "mood": null
        },
        {
            "title": "Isola",
            "author": "Allegra Goodman",
            "id": 10429004635946986428,
            "genres": [
                "Fiction",
                "Historical Fiction",
                "Women's Fiction"
            ],
            "review": " ISOLA is a stunning achievement that rivals Alexandre Dumas' and Victor Hugo's classic tales of adventure, survival and political intrigue. This gorgeous book by Allegra Goodman is about a woman who discovers her boldness and strength as the natural world around her reveals its most stinging and beautiful secrets. It is a story of woman vs. nature that will have readers riveted until the very last page. The heroine is Marguerite, heir to a château with its own village and properties. She is a child taken under the wing and supposed protection of Jean-François de La Rocque de Roberval, a volatile man who takes control of her life. He sells her land to pay his own debts and leaves her without a penny, then forces her to go with him on an expedition to New France. The only person who seems to truly care about her situation is one of Roberval’s servants, a bold and intriguing man himself, and they fall in love. \"ISOLA is a stunning achievement that rivals Alexandre Dumas' and Victor Hugo's classic tales of adventure, survival and political intrigue.... In a world that's constantly changing, the emotional and deliberate intensity of this story can offer all of us a balm.\" When Roberval discovers their passion, he punishes them by abandoning them on a small island where nature threatens to destroy them. How will Isola fight back against natural forces to find purchase and safety in this wild world? That is the focus of ISOLA. Goodman has based this story on a real-life adventure, as a 16th-century noblewoman suffered this horror on an island off the coast of Canada. She deftly captures the frailty and desires of this young woman, as well as the full range of searching questions facing her amidst this danger and despair. Why is she being treated this way? What forces have led her to this moment of supreme abandonment? Is the God she was taught to love and fear looking out for her, or is this just another lie she was taught as a gullible child? Perhaps the best part of this adventure is how Marguerite learns to trust herself, to discover strengths she didn’t know she had, and, above all, to show that she is a resilient and creative being who can fight against the best of what the world decides to throw at her. ISOLA is a magical and mesmerizing journey into one woman’s soul and how she flowers under the most horrific circumstances. In our world of reality TV shows like “Survivor” and “Naked and Afraid,” the exploits of men and women who wish to push themselves against the terrific power of the natural world are on full display. However, these adventurers take on this journey with full acceptance, unlike Marguerite. It is not lost on Goodman’s audience that the terms by which Marguerite must act are not exactly fair and represent the most difficult and horrific conditions in which any human can find himself or herself. With our extensive knowledge of how the natural world interacts with our own world, readers will connect most soundly to this incredible tale and the consequences that Marguerite faces. Goodman adds in a good dose of girl power for modern audiences, as well as a heavy helping of romance among the danger and derring-do. ISOLA is a story for the ages. In a world that's constantly changing, the emotional and deliberate intensity of this story can offer all of us a balm. As Marguerite builds a life with her own two hands, readers will find inspiration and exaltation in Allegra Goodman’s poetic tale of human survival. Reviewed by Jana Siciliano on February 7, 2025",
            "mood": null
        },
        {
            "title": "It Must Be Beautiful to Be Finished: A Memoir of My Body",
            "author": "Kate Gies",
            "id": 9030560402176944653,
            "genres": [
                "Memoir",
                "Nonfiction"
            ],
            "review": " A raw, beautiful memoir of a girl born missing an ear, a medical system insistent on saving her from herself, and our culture’s desire to “fix” bodies. When Kate Gies was four years old, a plastic surgeon pressed a synthetic ear to the right side of her head and pulled out a mirror. He told her he could make her “whole” --- could make her “right” --- and she believed him. From the ages of 4 to 13, she underwent 14 surgeries, including skin and bone grafts, to craft the appearance of an outer ear. Many of the surgeries failed, leaving permanent damage to her body. In short, lyrical vignettes, Kate writes about how her “disfigured” body was scrutinized, pathologized and even weaponized. She describes the physical and psychic trauma of medical intervention and its effects on her sense of self, first as a child needing to be fixed and, later, as a teenager and adult navigating the complex expectations and dangers of being a woman. IT MUST BE BEAUTIFUL TO BE FINISHED is the story of a girl desperately trying to have a body that makes her acceptable and of a woman learning to own a body she has never felt was hers to define. In an age of speaking out about the abuse of marginalized bodies, this memoir takes a hard look at the role of the medical system in body oppression and trauma.",
            "mood": null
        },
        {
            "title": "Junie",
            "author": "Erin Crosby Eckstine",
            "id": 1950131610650142689,
            "genres": [
                "Fiction",
                "Historical Fiction"
            ],
            "review": " A young girl must face a life-altering decision after awakening her sister’s ghost, navigating truths about love, friendship and power as the Civil War looms. Sixteen years old and enslaved since she was born, Junie has spent her life on Bellereine Plantation in Alabama, cooking and cleaning alongside her family, and tending to the white master’s daughter, Violet. Her daydreams are filled with poetry and faraway worlds, while she spends her nights secretly roaming through the forest, consumed with grief over the sudden death of her older sister, Minnie. When wealthy guests arrive from New Orleans, hinting at marriage for Violet and upending Junie’s life, she commits a desperate act --- one that rouses Minnie’s spirit from the grave, tethered to this world unless Junie can free her. She enlists the aid of Caleb, the guests’ coachman, and their friendship soon becomes something more. Yet as long-held truths begin to crumble, she realizes Bellereine is harboring dark and horrifying secrets that no longer can be ignored. With time ticking down, Junie begins to push against the harsh current that has controlled her entire life. As she grapples with an increasingly unfamiliar world in which she has little control, she is forced to ask herself: When we choose love and liberation, what must we leave behind?",
            "mood": null
        },
        {
            "title": "Kingdom of Claw: The Ashen Series, Book Two",
            "author": "Demi Winters",
            "id": 15125413531443677240,
            "genres": [
                "Fantasy",
                "Fiction",
                "Historical Fantasy",
                "Historical Fiction",
                "Historical Romance",
                "Romance"
            ],
            "review": " Return to the Kingdom of Íseldur, where enemies become lovers and dark secrets hide around each corner, in the sequel to the Viking-inspired romantic fantasy THE ROAD OF BONES. In the aftermath of a harrowing journey, Silla Nordvig’s dreams of a simple life have been shattered. Beaten, betrayed and reeling from the revelation of her true name, she flees Kopa with Reynir Galtung, the ruthless leader of the Bloodaxe Crew. But when they're forced into hiding together, Silla soon discovers that Rey has been keeping secrets of his own. Stuck in a shield-home with the murderous man she thought she knew, Silla forms a new plan: master the magic flowing through her veins to save her sister. But before she can do that, Silla must face her most formidable opponent yet --- her own inner demons. Saga Volsik has nothing to lose. They’ve murdered her family. Stolen her throne. And now they expect her to marry their son, but not if she can dismantle Queen Signe’s plans first. The only problem? The handsome Zagadkian dignitary who knows far too many of her secrets. Silla and Saga will need to find the strength to step into their destiny and stop chaos from sweeping across the land. Meanwhile, dark threads continue to weave themselves through Íseldur as magic long thought dead begins to wake.",
            "mood": null
        },
        {
            "title": "Last Twilight in Paris",
            "author": "Pam Jenoff",
            "id": 13279018269630223582,
            "genres": [
                "Fiction",
                "Historical Fiction"
            ],
            "review": " Fans of Pam Jenoff know that her historical novels don't just tell a story. They insert us right into the middle of shocking events most of us have never heard of that deserve to be exposed. The French capitulated to the Germans during WWII, and many didn't seem particularly opposed to assisting when it came to the impoundment of the Jewish French population. The French police joined in with the Gestapo to help round up the Jews of Paris, and many French citizens were only too happy to take for their own apartments that had belonged to Parisian Jews. Jenoff shares a little-known facet of that war in LAST TWILIGHT IN PARIS, a fictional account that takes place partly in Lévitan, the French furniture store that served as both a Jewish detention center and a shopping mecca for Nazi officers during the war. \"One of Jenoff's strengths as an author is her unerring ability to find obscure events that happened during WWII and tell them through the voices of fictional people she brings to life.... In LAST TWILIGHT IN PARIS, she has some truly clever twists in store for us as we try to reconcile the events in all the timelines.\" Jewish prisoners were housed in the store and forced to sort and polish the stolen belongings of the Jewish people whom the Germans sent to concentration camps. The story is told through the eyes of Helaine, a young Jewish woman who lives in Paris with her wealthy parents at the start of the novel, and Louise, who is from London and had volunteered for the Red Cross during the war. What connects these two ladies is a gold necklace called a mizpah, which Louise finds in 1953 at the bottom of a box of mostly rubbish that she sorts through at the local charity thrift shop. When she sees it, Louise is taken back to her time in the war, when she saw it in the hands of her friend, Franny. Jenoff is a master at doling out just a bit of information at a time so that we remain engrossed in the story and can't wait to uncover all the truths. We know that the necklace is important to Louise and that she feels some guilt related to it, but we don't know why. Franny’s death has haunted Louise. When she discovers the necklace, which she is convinced is the same one because of a chip on the top, she is determined to find out what really happened and why Franny died. Jenoff unfolds the story through Louise's first person narrative and Helaine's third person narrative. At first, the different timelines are a bit confusing. But Jenoff repeats the pattern of a chapter with Helaine's narrative starting in 1938 and moving forward chronologically, and another chapter with Louise's narrative beginning in \"present-day\" 1953 and traveling back to 1944 to recount Louise's activities then. It's difficult to envision how Jenoff will pull it all together and what Louise will find out about the necklace and its missing half. These were the days before computers and the internet. All records were paper, and many were destroyed by the Germans at the end of the war. One of Jenoff's strengths as an author is her unerring ability to find obscure events that happened during WWII and tell them through the voices of fictional people she brings to life. In doing so, she shines a light not only on little-known atrocities, but also on small, inspiring acts of courage. While on one level we know that the characters are not real, we can't stop reading as we are invested in seeing how their stories play out. And Jenoff is a magnificent storyteller. In LAST TWILIGHT IN PARIS, she has some truly clever twists in store for us as we try to reconcile the events in all the timelines. Perhaps now, more than ever, it's important to read and share books that demonstrate the evil of unchecked power and the dangers in demonizing \"the other.\" Reading about Helaine and Louise, two ordinary women who might have been separated by the English Channel, religion and their war experiences, but were connected by their human emotions, we observe their love for their family and their struggle to make sense of a world gone crazy. Reviewed by Pamela Kramer on February 7, 2025",
            "mood": null
        },
        {
            "title": "Memorial Days: A Memoir",
            "author": "Geraldine Brooks",
            "id": 15724092060978869540,
            "genres": [
                "Memoir",
                "Nonfiction"
            ],
            "review": " On May 27, 2019 --- Memorial Day --- Pulitzer Prize-winning journalist and historian Tony Horwitz collapsed and died on a Washington, DC sidewalk, less than two weeks before his 61st birthday. In her spare, beautiful memoir, MEMORIAL DAYS, his widow --- bestselling novelist and Pulitzer Prize winner Geraldine Brooks --- offers both a frank and moving portrait of her grief and a touching tribute to her late husband and the life they shared for more than three decades. Brooks received the news of Horwitz’s death in an abrupt phone call from a resident at George Washington University Medical Center while alone at the home on Martha’s Vineyard that they had shared since 2005. Their elder son, Nathaniel, was on a plane to Australia with his girlfriend, completing a post-college trip before starting his first job in Boston. Their younger son, Bizu, adopted at age five from Ethiopia and now a high school sophomore, was at his boarding school. As she raced to catch the plane in Boston that would take her to her brother-in-law’s home in Chevy Chase, Maryland, Brooks describes the fog of bewilderment in which she lived as she struggled to process the reality that her husband “with the toned body of a six-day-a-week gym rat” could be gone. “He’s way too busy living,” she writes. “He cannot possibly be dead.” Her every attempt to comprehend the incomprehensible falls short. \"Despite her book’s brevity, Brooks makes space for both informative and highly practical material.... Most people will find it easy to read MEMORIAL DAYS in a single sitting. The hard-earned lessons it imparts are ones that will endure for a lifetime.\" When he died, Horwitz indeed was busy living and working. He was nearing the end of an exhausting book tour to promote SPYING ON THE SOUTH, a work he produced while adhering to a punishing regimen that saw him consuming Nicorette gum by the box, nibbling the stimulant Provigil, and washing that down with pints of coffee, chasing those hours of concentrated effort with an intense workout at the gym. To bring himself down at night, Horwitz consumed large quantities of wine that had his cardiologist expressing concern about his drinking. When he reported a pair of episodes of shortness of breath during exercise, it was enough for the doctor to schedule a battery of tests. Sadly, that intervention came too late. Alternating with terse sections that describe the aftermath of Horwitz’s death, ending with the autopsy result that reveals its cause, and then the interment of his ashes in August 2019, is the story of what Brooks calls her own “memorial days” --- the several weeks she spent in February 2023 on tiny, remote Flinders Island, located off the northeast coast of Tasmania. The island, once part of a land bridge that connected Tasmania to Australia, Brooks’ homeland, is home to barely a thousand people. Over the course of her visit, she resides alone in two different tiny shacks, the first of which is so spartan it lacks indoor plumbing. Nearly four years after Horwitz’s passing, Brooks recognizes that she’s never taken the time to properly mourn her loss, and this extended interlude is her attempt to compensate for the absence of an adequate expression of her grief. Fresh from a book tour for HORSE, she confesses to erecting “a facade that I have hidden behind, a fugitive from my own feelings.” She purposefully had dammed up a necessary flood of tears, admitting her fear “that if I started, I mightn’t be able to stop,” but now she is determined to “let sadness come and accept it.” Brooks wanders the gorgeous island, nourished by striking topography that features a “juxtaposition of earth and water even more marvelous than Big Sur,” as she takes in its alluring flora and exotic nocturnal wildlife --- wallabies, pademelons and wombats. She spends hours paging through Horwitz’s journals dating back to their days as graduate students at Columbia Journalism School, where they met in 1983, and reflecting on their illustrious professional careers, conjoined for a time when they both worked as correspondents for the Wall Street Journal and shared a prize for their coverage of the first Iraq War. Inevitably, Brooks feels “furious with death,” cheated out of what she’d always envisioned as many years of shared experience and accomplishment. Her emotions are a reminder that no days are promised to any of us, and time together can’t be taken for granted at any age. But by the end of her sojourn, her solitary time in nature has brought her a measure of peace. Despite her book’s brevity, Brooks makes space for both informative and highly practical material. She describes the memorial customs of various traditions, including the Judaism she converted to when she married Horwitz in 1984, and the one known as “Sorry Business” among Australia’s First Nations People, as well as revealing the tragic persecution of the native people on Flinders Island in the 1830s. Along with navigating some of the difficulties of the Massachusetts probate system, Brooks recounts the terror of finding out that the family’s health insurance had been cancelled to illustrate the pitfalls of a marital division of labor. In their case, domestic chores fell to her, while Horwitz managed family finances. In the absence of meaningful overlap, she suggests that each spouse create a “Your Life: How It Works” document to make it easier for the survivor to navigate a solo future. Brooks mentions Joan Didion’s THE YEAR OF MAGICAL THINKING in passing, and the parallels between her experience and Didion’s are inescapable. But as she makes clear, every experience of grief is singular, and when it’s described with the emotional intelligence and eloquence of a writer like Brooks, it’s well worth adding to the sizable pile of books on this universal subject. Most people will find it easy to read MEMORIAL DAYS in a single sitting. The hard-earned lessons it imparts are ones that will endure for a lifetime. Reviewed by Harvey Freedenberg on February 7, 2025",
            "mood": null
        },
        {
            "title": "Mutual Interest",
            "author": "Olivia Wolfgang-Smith",
            "id": 12468044453251788086,
            "genres": [
                "Fiction",
                "Historical Fiction"
            ],
            "review": " There’s a reason why studios release movies that they think have a good chance at the Oscars late in the year. Memories are short, and sometimes a film that comes out in February is forgotten by December. Unfortunately, the same phenomenon can happen with books. But I’m making a note now not to forget about MUTUAL INTEREST when it comes time to compile “best books” lists at the end of the year. I’ve been anticipating this book for a while. Memories may be short, but Olivia Wolfgang-Smith’s debut, GLASSWORKS, was one of my favorites when it came out in 2023. That novel --- which traced a history of glass through multiple generations of a family --- was in some ways more structurally complex than MUTUAL INTEREST. But her sophomore effort is no less satisfying as its storytelling is just as compelling. The first section introduces readers to its primary characters. They don’t know each other then, but we meet them when they are still children or teenagers. \"MUTUAL INTEREST brilliantly explores the freedom that wealth affords its queer characters --- and the limitations that even wealth can’t overcome.\" In 1898, Vivian Lesperance is a rambunctious rebel who is desperate to escape Utica and her parents’ meanness and poverty. She is equally desperate to avoid marriage to a man, which her parents posit as her only way out, and begins to recognize her attraction to other girls. Oscar Schmidt, who is 20 years older than Vivian, grows up in central Ohio, confused and embarrassed by his attraction to other boys and (much like Vivian) desperate to escape to a place where his sexual orientation is less likely to mark him as strange. He finds freedom --- and a career in the soap-making business --- in New York City. Squire Clancy is a native New Yorker, raised in a loveless but fabulously wealthy household. As a child, his peculiarities are not around sexual orientation but his tendency to become transfixed by the strangest topics, from dinosaur fossils to sewer systems. As a young man, he becomes obsessed with the notion (outlandish at the time) of making scented candles. His path first crosses with Oscar’s after he corners the market on scented plants in order to conduct his experiments, stymying Oscar’s soap-making business. Oscar and Vivian --- who connected at a couple of parties and saw in one another kindred spirits of a sort --- already have established something of a marriage of convenience by the time Squire enters their lives. What began as a professional rivalry soon develops into something very different, as the three of them enter into business --- and unconventional personal and professional relationships that serve each of them very well indeed. As I mentioned, MUTUAL INTEREST is a fairly straightforward historical novel. It unfolds more or less chronologically, with storytelling that in some ways feels almost old-fashioned. But it’s also a thoroughly contemporary novel, inasmuch as it seeks to place fascinating, even inspiring, queer stories into the conventional Gilded Age narratives of wealth and power. Vivian is a fascinating character. Finding herself on the margins of New York society, she learns through observation and her own shrewdness how to manipulate that society to her own ends, and she’s fabulously successful at doing so. But even as she utilizes her relationship with Oscar and Squire (and their romantic relationship with each other) to acquire professional power practically unheard of for a woman of her time, she also bumps up against barriers to that power. Likewise, MUTUAL INTEREST brilliantly explores the freedom that wealth affords its queer characters --- and the limitations that even wealth can’t overcome. Reviewed by Norah Piehl on February 7, 2025",
            "mood": null
        },
        {
            "title": "Open Season: An Alex Delaware Novel",
            "author": "Jonathan Kellerman",
            "id": 17089763795216374486,
            "genres": [
                "Fiction",
                "Psychological Suspense",
                "Psychological Thriller",
                "Suspense",
                "Thriller"
            ],
            "review": " The most beloved and enduring duo in American crime fiction is back. Psychologist Alex Delaware and Homicide Detective Milo Sturgis race against time to find a twisted killer in this riveting thriller from the #1 New York Times bestselling “master of suspense” (Los Angeles Times). People come to Los Angeles to chase their dreams. Sometimes they find themselves cast into a nightmare. And sometimes, the most ardent dreamers turn out to be the most vicious monsters. The body of an aspiring actress is found dumped near a hospital emergency room. She’s been drugged and murdered, and the motive for the callous crime remains maddeningly out of reach. Until a prime suspect materializes. Another Hollywood hopeful. Only to be shot dead by a sniper using a weapon that turns out to have been catalogued in a previous murder. And another before that. It’s not long before more bodies begin piling up. What makes the murderous spree baffling is the apparent lack of connection among the victims. Is this the work of a random thrill killer, the toughest of all cases to unravel? But as Alex and Milo dig deeper they’re faced with an even knottier scenario: a highly complex killer with deep-seated motivation that will require all of their highly honed skills to decipher. The latest page-turner from #1 New York Times bestseller Jonathan Kellerman is a tale of psychological complexity, dark suspense and shocking surprises. A wild ride through L.A.’s surreal underbelly climaxed by an edge-of-the chair conclusion.",
            "mood": null
        },
        {
            "title": "Paris Undercover: A Wartime Story of Courage, Friendship, and Betrayal",
            "author": "Matthew Goodman",
            "id": 16947760746948230839,
            "genres": [
                "History",
                "Nonfiction"
            ],
            "review": " In June 1942, Etta Shiber was headed back to New York and away from Paris, where she had been a visitor, a citizen and an eventual inmate. Her liberation from Nazi captivity took over a year, but a compassionate release due to her failing health combined with diplomatic maneuverings paved the way. While free from the spartan conditions and harsh treatment of the Nazis, Etta ruminated on the well-being of her best friend and roommate, Kate Bonnefous. Kate was the initiator of the bold decision to aid in the escape of captive Allied soldiers in the early days of World War II. Etta was a New Yorker who had lived an unassuming existence until Europe descended into a martial environment and Paris was soon occupied. She had met Kate in 1926 when she was on vacation in Paris with her husband. The pair became fast friends, and Kate was a source of emotional support when Etta suffered the dual loss of her husband and a close cousin. She encouraged Etta to relocate to Paris, where the two resided until 1940. \"PARIS UNDERCOVER is a magnificent and in-depth re-examination of atypical heroines carrying out acts of gallantry.... This impressive effort functions as both a dual memoir and a wartime story, and you will not want to miss it.\" Kate was born into an affluent English family but was forced to cope with adversity when she lost both her parents in two years. As the eldest child, she needed to step up and arrange the care and guardianship of her siblings when her extended family balked at taking them in. Kate was a determined woman full of vigor who bucked social norms. Whereas Kate could be bold, Etta was timid and often beset by crippling anxiety. Kate was a person of action, and she dove headfirst into volunteer work at the commencement of the Second World War. Whether working at hospitals or serving as a defense warden, her devotion was unquestioned. Upon reading about wounded British soldiers being held by the enemy, Kate set upon an intrepid course of action with deadly consequences if caught. She would visit a convalescent soldier and make her proposal to abet in their flight for freedom. Etta would be fraught with anxiety when Kate informed her of this, but her loyalty to her friend outweighed her nerves. The operation would be unraveled within six months of its initiation as Kate, Etta and others were arrested. However, the impact of their contribution couldn’t be minimized, and while the Nazi government sought retribution, the press would see banner headlines meant to win hearts and minds. PARIS UNDERCOVER is a magnificent and in-depth re-examination of atypical heroines carrying out acts of gallantry. The historical record was flawed, but author Matthew Goodman’s comprehensive research elucidates the actions of Kate Bonnefous, Etta Shiber and others in 1940 when Europe was being overrun by the blitzkrieg of the Third Reich. The number of soldiers given shelter and assistance by Kate and her network was impressive. Kate and Etta’s story was meant to be told, but foolhardy decision-making coupled with greed led to a whitewashing of the truth. The compelling nature of the narrative is consistent, from the women’s path into each other’s lives to their subversive activities in a locked-down city to their harrowing incarcerations. This impressive effort functions as both a dual memoir and a wartime story, and you will not want to miss it. Reviewed by Philip Zozzaro on February 21, 2025",
            "mood": null
        },
        {
            "title": "Reading the Waves: A Memoir",
            "author": "Lidia Yuknavitch",
            "id": 3716924717132413091,
            "genres": [
                "Memoir",
                "Nonfiction"
            ],
            "review": " The frank and revealing memoir of a writer who draws from her own creativity to heal. \"I believe our bodies are carriers of experience,\" Lidia Yuknavitch writes in her provocative memoir READING THE WAVES. \"I mean to ask if there is a way to read my own past differently, using what I have learned from literature: how stories repeat and reverberate and release us from the tyranny of our mistakes, our traumas, and our confusions.\" Drawing on her background --- her father's abuse, her complicated dynamic with her disabled mother, the death of her child, her sexual relationships with men and women --- and her creative life as an author and teacher, Yuknavitch has come to understand that by using the power of literature and storytelling to reframe her memories, she can loosen the bonds that have enslaved her emotional growth. Armed with this insight, she allows herself to look with the eye of an artist at the wounds she suffered and come to understand the transformational power this has to restore her soul. By turns candid and lyrical, stoic and forgiving, blunt and evocative, READING THE WAVES reframes memory to show how crucial this process can be to gaining a deeper understanding of ourselves.",
            "mood": null
        },
        {
            "title": "Robert B. Parker's Buried Secrets: A Jesse Stone Novel",
            "author": "Christopher Farnsworth",
            "id": 6910200575341624764,
            "genres": [
                "Fiction",
                "Mystery"
            ],
            "review": " Police chief Jesse Stone investigates the mystery behind a dead body found strewn with photos of murder victims and placed on top of $2 million in cash, before a mob of hit men converge on Paradise. Just another day in Paradise. Chief of Police Jesse Stone is on his way home from a long shift when a call comes in for a welfare check on an elderly resident of the wealthy seaside town of Paradise, Massachusetts. Inside a house packed with junk and trash is a man’s dead body. It’s a sad, lonely end, but nothing criminal...until Jesse finds the photos of murder victims strewn around the corpse, on top of a treasure trove of $2 million in cash. Jesse takes on the case and finds a trail leading to an aging mobster who will do whatever it takes to keep the past from coming to light. Before long, Jesse has a price on his head as hit men converge on Paradise to take back the cash and destroy any remaining evidence. But the real danger might be coming from inside his own department. Jesse Stone must unearth the truth buried under the wreckage of a dead man’s life...before he winds up in the ground himself.",
            "mood": null
        },
        {
            "title": "Saint of the Narrows Street",
            "author": "William Boyle",
            "id": 12913859612879169675,
            "genres": [
                "Fiction"
            ],
            "review": " As an Italian American family's decades-old secret begins to unravel, they will have to bear the consequences --- and face each other --- in this thrilling southern Brooklyn-set tragic opera of the highest caliber from crime fiction luminary William Boyle. William Boyle is the master of Brooklyn-set crime fiction, and SAINT OF THE NARROWS STREET is his magnum opus. For fans of \"The Sopranos,\" Jonathan Lethem and Dennis Lehane. Gravesend, Brooklyn, 1986: Risa Franzone lives in a ground-floor apartment on Saint of the Narrows Street with her bad-seed husband, Saverio, and their eight-month-old baby, Fabrizio. On the night Risa's younger sister, Giulia, moves in to recover from a bad breakup, a fateful accident occurs: Risa, boiled over with anger and fear, strikes a drunk, erratic Sav with a cast-iron pan, killing him on the spot. The sisters are left with a choice: notify the authorities and make a case for self-defense, or bury the man's body and go on with their lives as best they can. In a moment of panic, in the late hours of the night, they call upon Sav's childhood friend --- the sweet, loyal Christopher \"Chooch\" Gardini --- to help them, hoping they can trust him to carry a secret like this. Over the vast expanse of the next 18 years, life goes on in the working-class Italian neighborhood of Gravesend as Risa, Giulia, Chooch and eventually Fabrizio grapple with what happened that night. A standout work of character-driven crime fiction from a celebrated author of the form, SAINT OF THE NARROWS STREET is a searing and richly drawn novel about the choices we make and how they shape our lives.",
            "mood": null
        },
        {
            "title": "Seeking Shelter: A Working Mother, Her Children, and a Story of Homelessness in America",
            "author": "Jeff Hobbs",
            "id": 13659849714218566916,
            "genres": [
                "Biography",
                "Nonfiction",
                "Social Sciences"
            ],
            "review": " From the bestselling author of THE SHORT AND TRAGIC LIFE OF ROBERT PEACE, a powerful portrayal of American homelessness that follows a single mother of six in Los Angeles courageously struggling to keep her family together and her children in school amidst the devastating housing crisis. In the tradition of EVICTED and INVISIBLE CHILD, Jeff Hobbs masterfully explores America’s housing crisis through the real-life story of Evelyn. This is Hobbs’ first book since THE SHORT AND TRAGIC LIFE OF ROBERT PEACE that focuses on a single character and her extraordinarily illuminating journey. In 2018, poverty and domestic violence cast Evelyn and her children into the urban wilderness of Los Angeles, where she avoids the family crisis network that offers no clear pathway for her children to remain together and in a decent school. For the next five years, Evelyn works full time as a waitress yet remains unable to afford legitimate housing or qualify for government aid. All the while she strives to provide stability, education, loving memories and college aspirations for her children even as they sleep in motels and in her car, living in fear of both her ex and the nation’s largest child welfare agency. Eventually Evelyn encounters Wendi Gaines, a recently trained social worker who decades earlier survived her own abusive marriage and housing crisis. Evelyn becomes one of Wendi’s first clients, and the relationship transforms them both. Told from the perspectives of Evelyn, Wendi, and Evelyn’s teenage son, Orlando, SEEKING SHELTER is a powerful and urgent exploration of the issues of homelessness, poverty and education in America --- a must-read for anyone interested in understanding not just social inequality and economic disparity in our society but also the power of a mother’s love and vision for her kids.",
            "mood": null
        },
        {
            "title": "Source Code: My Beginnings",
            "author": "Bill Gates",
            "id": 2998566203155430666,
            "genres": [
                "Memoir",
                "Nonfiction"
            ],
            "review": " The origin story of one of the most influential and transformative business leaders and philanthropists of the modern age. The business triumphs of Bill Gates are widely known: the 20-year-old who dropped out of Harvard to start a software company that became an industry giant and changed the way the world works and lives; the billionaire many times over who turned his attention to philanthropic pursuits to address climate change, global health and U.S. education.\n\t \n\tSOURCE CODE is not about Microsoft or the Gates Foundation or the future of technology. It’s the human, personal story of how Bill Gates became who he is today: his childhood, his early passions and pursuits. It’s the story of his principled grandmother and ambitious parents, his first deep friendships and the sudden death of his best friend; of his struggles to fit in and his discovery of a world of coding and computers in the dawn of a new era; of embarking in his early teens on a path that took him from midnight escapades at a nearby computer center to his college dorm room, where he sparked a revolution that would change the world.\n\t \n\tBill Gates tells this, his own story, for the first time. Wise, warm and revealing, it’s a fascinating portrait of an American life.",
            "mood": null
        },
        {
            "title": "Sweet Nothings: Confessions of a Candy Lover",
            "author": "Sarah Perry",
            "id": 2729800611296406750,
            "genres": [
                "Essays",
                "Humor",
                "Nonfiction"
            ],
            "review": " Sarah Perry's first book, AFTER THE ECLIPSE, was a harrowing memoir about her mother's murder when Perry was 12. Although it might seem like she has chosen a topic (candy) in complete opposition to her debut for her sophomore effort, there's still more than a little sour and salt mixed into the sweet. And this wonderful essay collection is all the better for it. Perry sets the tone with \"On Root Beer Barrels,\" which is the longest essay in the book. Not only does it discuss the titular candy, it offers a brief history of her home state of Maine's favorite soda (Moxie), which then gets wrapped up in a hilariously detailed account of her largely failed attempts to treat the raging yeast infection she picked up while on tour for AFTER THE ECLIPSE. At the time, she was contending with resurgent grief dredged up by writing and publishing a book about her late mom. You get the idea right from the beginning; this might be a sweet book about candy, but it's not just about candy, and it's not always that sweet. \"Here's hoping that this thoroughly delectable essay collection prompts many readers to (re)discover their own sweet tooth --- and cherish their wild, precious memories.\" Candy gives SWEET NOTHINGS its structure, though. Well, candy and color, since after that introductory piece, the 100 essays making up this slim but surprisingly dense (surely there's a candy metaphor here?) volume are grouped by color and arranged like a rainbow --- from the \"chewy reds\" of Twizzlers, Pop Rocks and Swedish Fish all the way through to the pink of Starburst and cotton candy. And not to worry, chocolate fans (whom Perry certainly would count herself among), she also includes lengthy collections of candies that fall under \"dark chocolate brown\" (including York Peppermint Patties, her mom's favorite), \"pale brown\" (Payday, Werther's Original), and \"milk chocolate brown\" (Twix and Toblerone, among others). Some essays are as brief as a short paragraph; others expand over pages. In some, the candy is the essay. Perry, a true aficionado, is remarkably adept at chronicling the most minute details of candy, from its appearance to the way it melts (or doesn't) in your mouth, to which candy wrappers are well designed and which are just annoying (yes, we're looking at you, Snickers!). In some cases, she offers scientific or historical context, or bits of trivia. Perhaps unsurprisingly, even though she is an unapologetic adult candy lover, many of the candies prompt Perry to cast her mind back to her childhood. She thinks about her mom, her mom's boyfriend and other relatives --- both before and after her mom's death --- as well as candies that, inevitably like childhood itself, have been discontinued. Sometimes the juxtapositions are funny, sad, sexy or wild --- as when she writes about \"unnamed Scandinavian candy eaten in San Pedro, Guatemala,\" comparing it unfavorably (and hilariously) to the orgy she had on that same trip. I remember years ago, when my parents had just finished reading Steve Almond's CANDY FREAK, they became obsessed with tracking down a couple of the candies that he wrote about. SWEET NOTHINGS is a very different book, but I’ve had a similar reaction. I now have a short (ok, long) list of candies to find, ones that Perry describes so lovingly and either I've never tried or I’d forgotten entirely until she jogged my memory. Here's hoping that this thoroughly delectable essay collection prompts many readers to (re)discover their own sweet tooth --- and cherish their wild, precious memories. Reviewed by Norah Piehl on February 21, 2025",
            "mood": null
        },
        {
            "title": "The Ghosts of Rome",
            "author": "Joseph O'Connor",
            "id": 465165671494635723,
            "genres": [
                "Fiction",
                "Historical Fiction",
                "Historical Thriller",
                "Suspense",
                "Thriller"
            ],
            "review": " In the final months of World War II, a clandestine group known as The Choir successfully smuggles thousands of escapees out of Nazi-occupied Rome via a secret route known as the Escape Line. When an unidentified airman falls wounded from the sky, The Choir is plunged into danger, and the survival of the Escape Line itself is threatened. The Escape Line’s collapse would leave thousands stranded. Monsignor Hugh O’Flaherty, its architect and the acknowledged leader of The Choir, broods inside the Vatican, paralyzed by the perils of keeping his Roman underground railroad functioning. Meanwhile, SS Commander Paul Hauptmann has been tasked with destroying the entire operation, and the price of failure is high --- his wife and children are under Gestapo lock-and-key in Berlin. Into this deliriously thrilling melee steps Contessa Giovanna Landini, a reckless, audacious and magnetic member of the Italian Resistance who has the nerve to challenge Hauptmann’s authority. Beautifully written and expertly crafted, THE GHOSTS OF ROME is a historical suspense novel bursting with action, atmosphere and unforgettable characters by one of contemporary fiction’s most acclaimed and beloved writers.",
            "mood": null
        },
        {
            "title": "The Lamb",
            "author": "Lucy Rose",
            "id": 16331737702694510668,
            "genres": [
                "Fiction",
                "Gothic",
                "Horror"
            ],
            "review": " Cannibals are having a moment. Or, perhaps, as symbols of death, destruction, gluttony and desire, they have long-held outsized attention relative to how very rare cannibalism really is. This horror is fertile ground for writers, and debut novelist Lucy Rose was not afraid to take it on in THE LAMB, a strange, gory and emotionally dense story of a mother and daughter with a taboo diet. Margot is just about 11 years old and has lived all her life with her mother, Ruth, in a small, dilapidated and moldy house far from neighbors. The walls are damp, the corners are full of cobwebs, and the bathtub drain is clogged with human fingers and rot. Before it was only Mama and Margot, Papa was there, too. But for Margot, Papa is a very distant memory; all she knows is that he left. The near-isolated life that Margot and Ruth share is punctuated with the arrivals of strays and the school bus. And then a third arrival threatens their already fragile life in the woods. \"[T]he prose is really good, Margot is quite compelling, and overall this is a creepy and atmospheric read. THE LAMB heralds a promising new talent.\" Margot attending the local school, driven back and forth by a concerned bus driver named Steve, makes little sense in Rose’s otherwise singular set, especially given Ruth’s extreme dysfunction and paranoia. Still, it does give Margot the chance to interact with others --- from Steve to a short-tempered teacher to a sweet friend named Abbie. One of the many truths that complicate Margot’s life is that Abbie’s father is having an affair with Ruth. Somehow, Abbie’s father, who Margot refers to as the gamekeeper, is entranced by the filthy and carnal Ruth and often visits the dirty house in the woods. But he is not a stray. Strays are those who get lost in the woods close to the house or have car trouble on the nearest road. Strays are those who, unfortunately, accept Ruth’s offer of hospitality and never leave her house again. Strays are the meat that feed Ruth and Margot. Eden shows up at the house one day, and Margot (as well as readers) never learn much about her. She seems to know about Ruth’s crimes and cannibalism right away, and immediately they begin a love affair. Eden is tender toward Margot but is mostly focused on Ruth and their shared cravings. As the days and weeks go by, Margot is all but forgotten as Ruth and Eden become increasingly intertwined. But when Eden’s attention eventually turns back to Margot, Margot realizes that any precarious safety she enjoyed is gone. THE LAMB is a dark novel --- part twisted fairy tale, part postmodern horror. At its heart, and beyond all the gristle and blood, it’s about a young girl and her relationship with her irreparably and mysteriously damaged mother. Margot is both sheltered from the world and exposed to her mother’s gruesome acts. She loves her but also fears her. And over the course of the novel, she arrives at grim realizations concerning how her mother feels about her. Like girls in many coming-of-age stories, Margot is separating from her but still clinging to her. There are inconsistencies in the book, and careful scrutiny reveals some flaws. Rose asks readers to make some mental leaps that are not always well supported in the storytelling. Still, the prose is really good, Margot is quite compelling, and overall this is a creepy and atmospheric read. THE LAMB heralds a promising new talent. Reviewed by Sarah Rachel Egelman on February 15, 2025",
            "mood": null
        },
        {
            "title": "The Mother Next Door: Medicine, Deception, and Munchausen by Proxy",
            "author": "Andrea Dunlop",
            "id": 1509218580509636299,
            "genres": [
                "Nonfiction",
                "True Crime"
            ],
            "review": " A groundbreaking work of narrative nonfiction that investigates Munchausen by Proxy from the host and creator of the award-winning true crime podcast \"Nobody Should Believe Me.\" No bond is more sacred than that between a mother and child. And no one is more sympathetic than a mother whose child faces a life-threatening illness. But what if the mother is the cause of the illness? What if the sympathy is the point? Munchausen by proxy (MBP) has fascinated and horrified both professionals and the general public since this disturbing form of child abuse was first identified. But even as the public has been captivated by these tales of abuse and deception, there remains widespread misinformation and confusion about MBP. Are these mothers unfeeling psychopaths, or sick women who need help? And more important, how can we protect the children whose lives are at stake? THE MOTHER NEXT DOOR offers a groundbreaking look at MBP from an unlikely duo: a Seattle novelist whose own family was torn apart by it, and the Texas detective who has worked on more medical child abuse cases than anyone in the nation. Readers ride along on three high-stakes MPB investigations; through riveting reporting and shocking stories from the family members, friends and doctors caught in the blast zone of these unthinkable acts, a twisted portrait of motherhood and deceit is revealed. With help from some of the top MBP experts in the world, Dunlop and Weber uncover the complex maze of psychological, systemic and cultural issues that compound MBP and offer solutions for how we might find our way out.",
            "mood": null
        }
    ]
}