[
    {
        "title": "A Forty Year Kiss",
        "author": "Nickolas Butler",
        "genres": [
            "Fiction",
            "Women's Fiction"
        ],
        "review": " From the critically acclaimed author of SHOTGUN LOVESONGS comes an exquisitely written, small-town story about one couple's hard-won second chance at love, 40 years after their divorce. Charlie and Vivian parted ways after just four years of marriage. Too many problems, too many struggles, even though the love didn't quite die. When Charlie returns to Wisconsin 40 years later, he's not sure what he'll find. He is sure of one thing --- he must try to reconnect with Vivian to pick up the broken pieces of their past. But 40 years is a long time. It's 40 years of other relationships, 40 years of building new lives, and 40 years of long-held regrets, mistakes and painful secrets. A brave and triumphant exploration of redemption and sunset triumph, A FORTY YEAR KISS is a once-in-a-lifetime love story, written with dazzling lyricism and remarkable clarity of spirit, from a celebrated author at the top of his game. It's a literary valentine that promises to be a love story for the ages."
    },
    {
        "title": "A Killing Cold",
        "author": "Kate Alice Marshall",
        "genres": [
            "Fiction",
            "Mystery",
            "Psychological Suspense",
            "Psychological Thriller",
            "Suspense",
            "Thriller"
        ],
        "review": " A woman invited to her wealthy fiance’s family retreat realizes they are hiding a terrible secret --- and that she’s been there before, by the bestselling author of WHAT LIES IN THE WOODS. A whirlwind romance.\n\tWhen Theodora Scott met Connor --- wealthy, charming and a member of the powerful Dalton family --- she fell in love in an instant. Six months later, he’s brought her to Idlewood, his family’s isolated winter retreat, to win over his skeptical relatives. Stay away from Connor Dalton.\n\tTheo has tried to ignore the threatening messages on her phone, but she can’t ignore the footprints in the snow outside the cabin window or the strange sense of familiarity she has about this place. Then, in a disused cabin, Theo finds something impossible: a photo of herself as a child. A photo taken at Idlewood. I’ve been here before.\n\tTheo has almost no recollection of her earliest years, but now she begins to piece together the fragments of her memories. Someone here has a shocking secret that they will do anything to keep hidden, and Theo is in terrible danger. Because the Daltons do not lose, and discovering what happened at Idlewood may cost Theo everything."
    },
    {
        "title": "A Long Time Gone",
        "author": "Joshua Moehling",
        "genres": [
            "Fiction",
            "Mystery",
            "Suspense",
            "Thriller"
        ],
        "review": " It's time to put the past to rest… Ben Packard was just a boy when his older brother disappeared. Ben watched him walk out the back door of their grandparents' house and into the cold night. His brother was never seen again. Decades later, Deputy Packard finds himself with too much time on his hands. A shooting has him on leave and under investigation, and all he can do is dwell on the past. For the first time in years, new information about his brother has surfaced that may lead them to the location of a body. The midwinter ground is frozen solid. Worse, Packard is cut off from department resources. As he strikes out to finally uncover the truth behind his brother's disappearance, he stumbles on a separate, suspicious death. A tenuous connection exists between the two cases, and as Packard starts to dig, he meets fierce resistance from friends and foes alike who want him to stand down. The winter is long and cold. By the end of it, Packard will risk everything to catch a killer and reveal the shocking truth about his brother."
    },
    {
        "title": "A Season of Light",
        "author": "Julie Iromuanya",
        "genres": [
            "Fiction",
            "Women's Fiction"
        ],
        "review": " For fans of BEHOLD THE DREAMERS comes a compelling novel about a tightly bound Nigerian family living in Florida and the wounds that get passed down from generation to generation, from the author of the acclaimed MR. AND MRS. DOCTOR. When 276 schoolgirls are abducted from their school in Nigeria, Fidelis Ewerike, a Florida-based barrister, poet and former POW of the Nigerian Civil War, begins to go mad, consumed by memories of his younger sister, Ugochi, who went missing during that conflict. Consumed by survivor’s guilt and fearful that the same fate awaits Amara, his 16-year-old daughter who bears an uncanny resemblance to Ugochi, Fidelis locks her in her bedroom, offering no words of explanation, only lovingly --- if poorly --- made meals and sweets. Amid that singular action, the Ewerike family spirals into chaos. After unsuccessful attempts to free her daughter from her room, his wife, Adaobi, seeks the counsel of a preacher, praying for spiritual liberation from the curse she is certain has plagued her family since leaving Nigeria. Fourteen-year-old Chuk, beset by his own war with the neighborhood boys, receives a painful education on force, masculinity, and his tenuous position within his family. And rebellious, resentful Amara is hungry for her life to be hers, so the moment she is able to escape her imprisonment, she falls in love --- not with the Aba-born engineer-in-training her mother envisages, but with Maksym Kostyk, the son of the town drunk. Before long, the two have concocted a plan to run away from the trappings of their familial traumas. Perfect for readers of SING, UNBURIED, SING, Julie Iromuanya's A SEASON OF LIGHT is an all-consuming masterpiece. To peer into the window of the Ewerike family’s lives is a gift."
    },
    {
        "title": "A Time for Reflection: The Parallel Legacies of Baseball Icons Willie McCovey and Billy Williams",
        "author": "Jason Cannon",
        "genres": [
            "Biography",
            "Nonfiction",
            "Sports"
        ],
        "review": " A fascinating look back at the incredible lives and careers of baseball Hall of Famers Willie McCovey and Billy Williams. Professional baseball has featured a bevy of superstars over the past century and a half, but only a few of them have impacted their sport and cities as deeply as Willie McCovey and Billy Williams. Born just a handful of miles apart in 1938, they grew up in and around one of the sport’s true cradles, Mobile, Alabama, on their way to producing two iconic careers in Major League Baseball. In A TIME FOR REFLECTION, Jason Cannon examines these two legends of the game. Overcoming the heinous racism of the Jim Crow South as part of the second generation of African American major leaguers who followed in the footsteps of Jackie Robinson, they became two of baseball’s all-time greatest players. Off the field, they took impactful stands for racial progress that continue to resonate today. Their personal resolve, leadership in the clubhouse and dedication to their baseball communities endeared them to teammates and fans alike. Featuring original interviews with family members, friends, teammates and Williams himself, A TIME FOR REFLECTION brings to life their monumental accomplishments on the diamond, while also detailing how McCovey and Williams grew into pillars of San Francisco and Chicago and inspired future generations of ballplayers."
    },
    {
        "title": "Bibliophobia: A Memoir",
        "author": "Sarah Chihaya",
        "genres": [
            "Literary Criticism",
            "Memoir",
            "Nonfiction"
        ],
        "review": " Books can seduce you. They can, Sarah Chihaya believes, annihilate, reveal and provoke you. And anyone incurably obsessed with books understands this kind of unsettling literary encounter. Sarah calls books that have this effect “Life Ruiners.” Her Life Ruiner, Toni Morrison’s THE BLUEST EYE, became a talisman for her in high school when its electrifying treatment of race exposed Sarah’s deepest feelings about being Japanese American in a predominantly white suburb of Cleveland. But Sarah had always lived through her books, seeking escape, self-definition and rules for living. She built her life around reading, wrote criticism, and taught literature at an Ivy League University. Then she was hospitalized for a nervous breakdown, and the world became an unreadable blank page. In the aftermath, she was faced with a question. Could we ever truly rewrite the stories that govern our lives? BIBLIOPHOBIA is an alternately searing and darkly humorous story of breakdown and survival told through books. Delving into texts such as ANNE OF GREEN GABLES, POSSESSION, A TALE FOR THE TIME BEING and THE LAST SAMURAI, Chihaya interrogates her cultural identity, her relationship with depression, and the intoxicating, sometimes painful, ways books push back on those who love them."
    },
    {
        "title": "Black Woods, Blue Sky",
        "author": "Eowyn Ivey",
        "genres": [
            "Fiction",
            "Magical Realism"
        ],
        "review": " Eowyn Ivey, the Pulitzer Prize finalist and New York Times bestselling author of THE SNOW CHILD,  returns to the mythical landscapes of Alaska with an unforgettable dark fairy tale that asks the question: Can love save us from ourselves? Birdie is keeping it together; of course she is. So she’s a little hungover, sometimes, and she has to bring her daughter, Emaleen, to her job waiting tables at an Alaskan roadside lodge, but she’s getting by as a single mother in a tough town. Still, Birdie can remember happier times from her youth, when she was free in the wilds of nature. Arthur Neilsen, a soft-spoken and scarred recluse who appears in town only at the change of seasons, brings Emaleen back to safety when she gets lost in the woods. Most people avoid him, but to Birdie, he represents everything she’s ever longed for. She finds herself falling for Arthur and the land he knows so well. Against the warnings of those who care about them, Birdie and Emaleen move to his isolated cabin in the mountains, on the far side of the Wolverine River. It’s just the three of them in the vast black woods, far from roads, telephones, electricity and outside contact, but Birdie believes she has come prepared. At first, it’s idyllic and she can picture a happily ever after: Together they catch salmon, pick berries, and climb mountains so tall it’s as if they could touch the bright blue sky. But soon Birdie discovers that Arthur is something much more mysterious and dangerous than she ever could have imagined and that like the Alaska wilderness, a fairy tale can be as dark as it is beautiful. BLACK WOODS, BLUE SKY is a novel with life-and-death stakes, about the love between a mother and daughter, and the allure of a wild life --- about what we gain and what it might cost us."
    },
    {
        "title": "Bonded in Death",
        "author": "J. D. Robb",
        "genres": [
            "Fiction",
            "Mystery",
            "Suspense",
            "Thriller"
        ],
        "review": " #1 New York Times bestselling author J. D. Robb spins an epic tale of loyalty, treachery, murder and the long shadow of war. His passport read Giovanni Rossi. But decades ago, during the Urban Wars, he was part of a small, secret organization called The Twelve. Responding to an urgent summons from an old compatriot, he landed in New York and eased into the waiting car. And died within minutes. Lieutenant Eve Dallas finds the Rossi case frustrating. She has an elderly victim who just arrived from Rome; a widow who knows nothing about why he left; an as-yet unidentifiable weapon and zero results on facial recognition. But when she finds a connection to the Urban Wars of the 2020s, she thinks Summerset --- fiercely loyal, if somewhat grouchy, majordomo and the man who rescued her husband from the Dublin streets --- may know something from his stint as a medic in Europe back then. When Summerset learns of the crime, his shock and grief are clear --- because, as he eventually reveals, he himself was one of The Twelve. It’s not a part of his past he likes to revisit. But now he must --- not only to assist Eve’s investigation, but because a cryptic message from the killer has boasted that others of The Twelve have also died. Summerset is one of those who remain --- and the murderous mission is yet to be fully accomplished."
    },
    {
        "title": "Cleavage: Men, Women, and the Space Between Us",
        "author": "Jennifer Finney Boylan",
        "genres": [
            "Gender Studies",
            "Memoir",
            "Nonfiction"
        ],
        "review": " What is the difference between men and women? Jennifer Finney Boylan, the bestselling author of SHE'S NOT THERE and co-author of MAD HONEY with Jodi Picoult, examines the divisions --- as well as the common ground --- between the genders and reflects on her own experiences, both difficult and joyful, as a transgender American. SHE'S NOT THERE was the first bestselling work written by a transgender American. Since its publication 20 years ago, Jennifer Finney Boylan has become the go-to person for insight into the impact of gender on our lives --- from the food we eat to the dreams we dream, both for ourselves and for our children. But CLEAVAGE is more than a deep dive into gender identity; it’s also a look at the difference between coming out as trans in 2000 --- when many people reacted to Boylan’s transition with love --- and the present era of blowback and fear. How does gender affect our sense of self? Our body image? The passage of time? The friends we lose --- and keep? Boylan considers her womanhood, reflects on the boys and men who shaped her, and reconceives of herself as a writer, activist, parent and spouse. With heart-wrenching honesty, she illustrates the feeling of liminality that followed her to adulthood, but demonstrates the redemptive power of love through it all. With Boylan’s trademark humor and poignancy, CLEAVAGE is a sharp, witty and captivating look at the triumphs and losses of a life lived in two genders. It provides hope for a future in which we all have the freedom to live joyfully as men, as women and in the space between us."
    },
    {
        "title": "Dead in the Frame: A Pentecost and Parker Mystery",
        "author": "Stephen Spotswood",
        "genres": [
            "Fiction",
            "Historical Fiction",
            "Historical Mystery",
            "Mystery"
        ],
        "review": " The most dramatic installment yet in the Nero Award–winning Pentecost and Parker series, as Will scrambles to solve a shocking murder before Lillian takes the fall for the crime. New York City, 1947: Wealthy financier and ghoulish connoisseur of crime Jessup Quincannon is dead, and famed detective Lillian Pentecost is under arrest for his murder. Means, motive and a mountain of evidence leave everyone believing she’s guilty. Everyone, that is, except Willowjean “Will” Parker, who knows for a fact her boss is innocent. She just doesn’t know if she can prove it. With Lillian locked away in the House of D --- New York City’s infamous women’s prison --- Will is left to root out the real killer. Was it a member of Quincannon’s murder-obsessed Black Museum Club? Maybe it was his jilted lover? Or his beautiful, certainly-sociopathic bodyguard? And what about the mob hit-man who just happened to disappear after the shots were fired? With the city barreling toward the trial of the century, each day brings fresh headlines and hints of long-buried scandals from Lillian’s past. Will is desperate to get her boss out from behind bars before her reputation is destroyed. Because the House of D is no kind place, especially for a woman with multiple sclerosis. Or one with so many enemies. Her health failing and being targeted by someone who wants her dead, Lillian needs to survive long enough to take the stand. With time running out on both sides of the prison walls, Will and Lillian must wager everything to uncover who put their thumb on the scales and a bullet in Quincannon’s head. Before Lady Justice brings her sword down, ending Pentecost and Parker's adventures once and for all."
    },
    {
        "title": "Gliff",
        "author": "Ali Smith",
        "genres": [
            "Fiction",
            "Women's Fiction"
        ],
        "review": " From a literary master, a moving and genre-bending story about our era-spanning search for meaning and knowing. An uncertain near-future. A story of new boundaries drawn between people daily. A not-very brave new world. Add two children. And a horse. From a Scottish word meaning a transient moment, a shock, a faint glimpse, GLIFF explores how and why we endeavor to make a mark on the world. In a time when western industry wants to reduce us to algorithms and data --- something easily categorizable and predictable --- Ali Smith shows us why our humanity, our individual complexities, matter more than ever."
    },
    {
        "title": "Harlem Rhapsody",
        "author": "Victoria Christopher Murray",
        "genres": [
            "Fiction",
            "Historical Fiction",
            "Women's Fiction"
        ],
        "review": " She found the literary voices that would inspire the world. The extraordinary story of the woman who ignited the Harlem Renaissance, written by Victoria Christopher Murray, the New York Times bestselling coauthor of THE PERSONAL LIBRARIAN. In 1919, a high school teacher from Washington, D.C arrives in Harlem excited to realize her lifelong dream. Jessie Redmon Fauset has been named the literary editor of The Crisis. The first Black woman to hold this position at a preeminent Negro magazine, Jessie is poised to achieve literary greatness. But she holds a secret that jeopardizes it all. W. E. B. Du Bois, the founder of The Crisis, is not only Jessie’s boss, he’s her lover. And neither his wife nor their 14-year age difference can keep the two apart. Amidst rumors of their tumultuous affair, Jessie is determined to prove herself. She attacks the challenge of discovering young writers with fervor, finding 16-year-old Countee Cullen, 17-year-old Langston Hughes, and Nella Larsen, who becomes one of her best friends. Under Jessie’s leadership, The Crisis thrives. Every African American writer in the country wants their work published there. When her first novel is released to great acclaim, it’s clear that Jessie is at the heart of a renaissance in Black music, theater and the arts. She has shaped a generation of literary legends, but as she strives to preserve her legacy, she’ll discover the high cost of her unparalleled success."
    },
    {
        "title": "Isola",
        "author": "Allegra Goodman",
        "genres": [
            "Fiction",
            "Historical Fiction",
            "Women's Fiction"
        ],
        "review": " A young woman and her lover are marooned on an island in this “lushly painted” (People) epic saga of love, faith and defiance from the bestselling author of SAM. Heir to a fortune, Marguerite is destined for a life of prosperity and gentility. Then she is orphaned, and her guardian --- an enigmatic and volatile man --- spends her inheritance and insists she accompany him on an expedition to New France. That journey takes an unexpected turn when Marguerite, accused of betrayal, is brutally punished and abandoned on a small island. Once a child of privilege who dressed in gowns and laced pearls in her hair, Marguerite finds herself at the mercy of nature. As the weather turns, blanketing the island in ice, she discovers a faith she’d never before needed. Inspired by the real life of a 16th-century heroine, ISOLA is the timeless story of a woman fighting for survival."
    },
    {
        "title": "It Must Be Beautiful to Be Finished: A Memoir of My Body",
        "author": "Kate Gies",
        "genres": [
            "Memoir",
            "Nonfiction"
        ],
        "review": " A raw, beautiful memoir of a girl born missing an ear, a medical system insistent on saving her from herself, and our culture’s desire to “fix” bodies. When Kate Gies was four years old, a plastic surgeon pressed a synthetic ear to the right side of her head and pulled out a mirror. He told her he could make her “whole” --- could make her “right” --- and she believed him. From the ages of 4 to 13, she underwent 14 surgeries, including skin and bone grafts, to craft the appearance of an outer ear. Many of the surgeries failed, leaving permanent damage to her body. In short, lyrical vignettes, Kate writes about how her “disfigured” body was scrutinized, pathologized and even weaponized. She describes the physical and psychic trauma of medical intervention and its effects on her sense of self, first as a child needing to be fixed and, later, as a teenager and adult navigating the complex expectations and dangers of being a woman. IT MUST BE BEAUTIFUL TO BE FINISHED is the story of a girl desperately trying to have a body that makes her acceptable and of a woman learning to own a body she has never felt was hers to define. In an age of speaking out about the abuse of marginalized bodies, this memoir takes a hard look at the role of the medical system in body oppression and trauma."
    },
    {
        "title": "Junie",
        "author": "Erin Crosby Eckstine",
        "genres": [
            "Fiction",
            "Historical Fiction"
        ],
        "review": " A young girl must face a life-altering decision after awakening her sister’s ghost, navigating truths about love, friendship and power as the Civil War looms. Sixteen years old and enslaved since she was born, Junie has spent her life on Bellereine Plantation in Alabama, cooking and cleaning alongside her family, and tending to the white master’s daughter, Violet. Her daydreams are filled with poetry and faraway worlds, while she spends her nights secretly roaming through the forest, consumed with grief over the sudden death of her older sister, Minnie. When wealthy guests arrive from New Orleans, hinting at marriage for Violet and upending Junie’s life, she commits a desperate act --- one that rouses Minnie’s spirit from the grave, tethered to this world unless Junie can free her. She enlists the aid of Caleb, the guests’ coachman, and their friendship soon becomes something more. Yet as long-held truths begin to crumble, she realizes Bellereine is harboring dark and horrifying secrets that no longer can be ignored. With time ticking down, Junie begins to push against the harsh current that has controlled her entire life. As she grapples with an increasingly unfamiliar world in which she has little control, she is forced to ask herself: When we choose love and liberation, what must we leave behind?"
    },
    {
        "title": "Kingdom of Claw: The Ashen Series, Book Two",
        "author": "Demi Winters",
        "genres": [
            "Fantasy",
            "Fiction",
            "Historical Fantasy",
            "Historical Fiction",
            "Historical Romance",
            "Romance"
        ],
        "review": " Return to the Kingdom of Íseldur, where enemies become lovers and dark secrets hide around each corner, in the sequel to the Viking-inspired romantic fantasy THE ROAD OF BONES. In the aftermath of a harrowing journey, Silla Nordvig’s dreams of a simple life have been shattered. Beaten, betrayed and reeling from the revelation of her true name, she flees Kopa with Reynir Galtung, the ruthless leader of the Bloodaxe Crew. But when they're forced into hiding together, Silla soon discovers that Rey has been keeping secrets of his own. Stuck in a shield-home with the murderous man she thought she knew, Silla forms a new plan: master the magic flowing through her veins to save her sister. But before she can do that, Silla must face her most formidable opponent yet --- her own inner demons. Saga Volsik has nothing to lose. They’ve murdered her family. Stolen her throne. And now they expect her to marry their son, but not if she can dismantle Queen Signe’s plans first. The only problem? The handsome Zagadkian dignitary who knows far too many of her secrets. Silla and Saga will need to find the strength to step into their destiny and stop chaos from sweeping across the land. Meanwhile, dark threads continue to weave themselves through Íseldur as magic long thought dead begins to wake."
    },
    {
        "title": "Last Twilight in Paris",
        "author": "Pam Jenoff",
        "genres": [
            "Fiction",
            "Historical Fiction"
        ],
        "review": " A Parisian department store, a mysterious necklace and a woman’s quest to unlock a decade-old mystery are at the center of this riveting novel of love and survival, from New York Times bestselling author Pam Jenoff. London, 1953. Louise is still adjusting to her postwar role as a housewife when she discovers a necklace in a box at a secondhand shop. The box is marked with the name of a department store in Paris, and she is certain she has seen the necklace before worked with the Red Cross in Nazi-occupied Europe --- and that it holds the key to the mysterious death of her friend Franny during the war. Following the trail of clues to Paris, Louise seeks help from her former boss Ian, with whom she shares a romantic history. The necklace leads them to discover the dark history of Lévitan --- a once-glamorous department store that served as a Nazi prison, and Helaine, a woman who was imprisoned there, torn apart from her husband when the Germans invaded France. Louise races to find the connection between the necklace, the department store and Franny’s death. But nothing is as it seems, and there are forces determined to keep the truth buried forever. Inspired by the true story of Lévitan, LAST TWILIGHT IN PARIS is both a gripping mystery and an unforgettable story about sacrifice, resistance and the power of love to transcend in even the darkest hours."
    },
    {
        "title": "Memorial Days: A Memoir",
        "author": "Geraldine Brooks",
        "genres": [
            "Memoir",
            "Nonfiction"
        ],
        "review": " A heartrending and beautiful memoir of sudden loss and a journey towards peace, from the bestselling, Pulitzer Prize-winning author of  HORSE. Many cultural and religious traditions expect those who are grieving to step away from the world. In contemporary life, we are more often met with red tape and to-do lists. This is exactly what happened to Geraldine Brooks when her partner of more than three decades, Tony Horwitz --- just 60 years old and, to her knowledge, vigorous and healthy --- collapsed and died on a Washington, D.C. sidewalk. After spending their early years together in conflict zones as foreign correspondents, Geraldine and Tony settled down to raise two boys on Martha’s Vineyard. The life they built was one of meaningful work, good humor and tenderness, as they spent their days writing and their evenings cooking family dinners or watching the sun set with friends at the beach. But all of this ended abruptly when, on Memorial Day 2019, Geraldine received the phone call we all dread. The demands were immediate and many. Without space to grieve, the sudden loss became a yawning gulf. Three years later, she booked a flight to a remote island off the coast of Australia with the intention of finally giving herself the time to mourn. In a shack on a pristine, rugged coast, she often went days without seeing another person. There, she pondered the various ways in which cultures grieve and what rituals of her own might help to rebuild a life around the void of Tony’s death. A spare and profoundly moving memoir that joins the classics of the genre, MEMORIAL DAYS is a portrait of a larger-than-life man and a timeless love between souls that exquisitely captures the joy, agony and mystery of life."
    },
    {
        "title": "Mutual Interest",
        "author": "Olivia Wolfgang-Smith",
        "genres": [
            "Fiction",
            "Historical Fiction"
        ],
        "review": " A classic in the making: a mesmerizing novel about marriage and ambition, sexuality and secrecy, and the true costs of building an empire. At the turn of the 20th century, Vivian Lesperance is determined to flee her origins in Utica, New York, and avoid repeating her parents' dull, limited life. When she meets Oscar Schmidt, a middle manager at a soap company, Vivian finds a partner she can guide to build the life she wants --- not least because, more interested in men himself, Oscar will leave Vivian to tend to her own romances with women. But Vivian's plans require capital, so the two pair up with Squire Clancey, scion of an old American fortune. Together they found Clancey & Schmidt, a preeminent manufacturer of soap, perfume and candles. When Oscar and Squire fall in love, the trio form a new kind of partnership. Vivian reaches the pinnacle of her power building Clancey & Schmidt into an empire of personal care products while operating behind the image of both men. But exposure threatens, and all three partners are made aware of how much they have to lose. For readers of Hernan Diaz's TRUST and Colm Tóibín's THE MAGICIAN, with echoes of Gustave Flaubert and E.M. Forster, MUTUAL INTEREST is a beguiling story of queer romance, empire and power."
    },
    {
        "title": "Open Season: An Alex Delaware Novel",
        "author": "Jonathan Kellerman",
        "genres": [
            "Fiction",
            "Psychological Suspense",
            "Psychological Thriller",
            "Suspense",
            "Thriller"
        ],
        "review": " The most beloved and enduring duo in American crime fiction is back. Psychologist Alex Delaware and Homicide Detective Milo Sturgis race against time to find a twisted killer in this riveting thriller from the #1 New York Times bestselling “master of suspense” (Los Angeles Times). People come to Los Angeles to chase their dreams. Sometimes they find themselves cast into a nightmare. And sometimes, the most ardent dreamers turn out to be the most vicious monsters. The body of an aspiring actress is found dumped near a hospital emergency room. She’s been drugged and murdered, and the motive for the callous crime remains maddeningly out of reach. Until a prime suspect materializes. Another Hollywood hopeful. Only to be shot dead by a sniper using a weapon that turns out to have been catalogued in a previous murder. And another before that. It’s not long before more bodies begin piling up. What makes the murderous spree baffling is the apparent lack of connection among the victims. Is this the work of a random thrill killer, the toughest of all cases to unravel? But as Alex and Milo dig deeper they’re faced with an even knottier scenario: a highly complex killer with deep-seated motivation that will require all of their highly honed skills to decipher. The latest page-turner from #1 New York Times bestseller Jonathan Kellerman is a tale of psychological complexity, dark suspense and shocking surprises. A wild ride through L.A.’s surreal underbelly climaxed by an edge-of-the chair conclusion."
    },
    {
        "title": "Paris Undercover: A Wartime Story of Courage, Friendship, and Betrayal",
        "author": "Matthew Goodman",
        "genres": [
            "History",
            "Nonfiction"
        ],
        "review": " Two women in Nazi-occupied Paris created a daring escape line that rescued dozens of Allied servicemen. With one still in a German prison camp, the other wrote a book about it --- a memoir built on fabrications. Now the bestselling author of EIGHTY DAYS shares their incredible, never-before-told full story. Etta Shiber and Kate Bonnefous are the unlikeliest of heroines: two seemingly ordinary women, an American widow and an English divorcée, living quietly together in Paris. Yet during the Nazi occupation, these two friends find themselves unexpectedly plunged into the whirlwind of history. With the help of a French country priest and others, they set out to rescue British and French soldiers trapped behind enemy lines --- some of whom they daringly smuggle through Nazi checkpoints hidden inside the trunk of their car. Ultimately the Gestapo captures them both. After 18 months in prison, Etta is returned to the United States in a prisoner exchange. Back home, hoping to bring attention to her friend Kitty’s bravery, she publishes a memoir about their work. PARIS-UNDERGROUND becomes a publishing sensation and Etta a celebrity. Meanwhile, Kate spends the rest of the war in a Nazi prison, entirely unaware of the book that has been written about her --- and the deeds that have been claimed in her name. In researching this story, Matthew Goodman uncovered military records and personal testimonies that reveal, for the first time, the shocking truth behind Etta’s memoir and the unexpected, far-reaching consequences of its publication. More than just a story of two women’s remarkable courage, PARIS UNDERCOVER is a vivid, gripping account of deceit, betrayal and personal redemption."
    },
    {
        "title": "Reading the Waves: A Memoir",
        "author": "Lidia Yuknavitch",
        "genres": [
            "Memoir",
            "Nonfiction"
        ],
        "review": " The frank and revealing memoir of a writer who draws from her own creativity to heal. \"I believe our bodies are carriers of experience,\" Lidia Yuknavitch writes in her provocative memoir READING THE WAVES. \"I mean to ask if there is a way to read my own past differently, using what I have learned from literature: how stories repeat and reverberate and release us from the tyranny of our mistakes, our traumas, and our confusions.\" Drawing on her background --- her father's abuse, her complicated dynamic with her disabled mother, the death of her child, her sexual relationships with men and women --- and her creative life as an author and teacher, Yuknavitch has come to understand that by using the power of literature and storytelling to reframe her memories, she can loosen the bonds that have enslaved her emotional growth. Armed with this insight, she allows herself to look with the eye of an artist at the wounds she suffered and come to understand the transformational power this has to restore her soul. By turns candid and lyrical, stoic and forgiving, blunt and evocative, READING THE WAVES reframes memory to show how crucial this process can be to gaining a deeper understanding of ourselves."
    },
    {
        "title": "Robert B. Parker's Buried Secrets: A Jesse Stone Novel",
        "author": "Christopher Farnsworth",
        "genres": [
            "Fiction",
            "Mystery"
        ],
        "review": " Police chief Jesse Stone investigates the mystery behind a dead body found strewn with photos of murder victims and placed on top of $2 million in cash, before a mob of hit men converge on Paradise. Just another day in Paradise. Chief of Police Jesse Stone is on his way home from a long shift when a call comes in for a welfare check on an elderly resident of the wealthy seaside town of Paradise, Massachusetts. Inside a house packed with junk and trash is a man’s dead body. It’s a sad, lonely end, but nothing criminal...until Jesse finds the photos of murder victims strewn around the corpse, on top of a treasure trove of $2 million in cash. Jesse takes on the case and finds a trail leading to an aging mobster who will do whatever it takes to keep the past from coming to light. Before long, Jesse has a price on his head as hit men converge on Paradise to take back the cash and destroy any remaining evidence. But the real danger might be coming from inside his own department. Jesse Stone must unearth the truth buried under the wreckage of a dead man’s life...before he winds up in the ground himself."
    },
    {
        "title": "Saint of the Narrows Street",
        "author": "William Boyle",
        "genres": [
            "Fiction"
        ],
        "review": " As an Italian American family's decades-old secret begins to unravel, they will have to bear the consequences --- and face each other --- in this thrilling southern Brooklyn-set tragic opera of the highest caliber from crime fiction luminary William Boyle. William Boyle is the master of Brooklyn-set crime fiction, and SAINT OF THE NARROWS STREET is his magnum opus. For fans of \"The Sopranos,\" Jonathan Lethem and Dennis Lehane. Gravesend, Brooklyn, 1986: Risa Franzone lives in a ground-floor apartment on Saint of the Narrows Street with her bad-seed husband, Saverio, and their eight-month-old baby, Fabrizio. On the night Risa's younger sister, Giulia, moves in to recover from a bad breakup, a fateful accident occurs: Risa, boiled over with anger and fear, strikes a drunk, erratic Sav with a cast-iron pan, killing him on the spot. The sisters are left with a choice: notify the authorities and make a case for self-defense, or bury the man's body and go on with their lives as best they can. In a moment of panic, in the late hours of the night, they call upon Sav's childhood friend --- the sweet, loyal Christopher \"Chooch\" Gardini --- to help them, hoping they can trust him to carry a secret like this. Over the vast expanse of the next 18 years, life goes on in the working-class Italian neighborhood of Gravesend as Risa, Giulia, Chooch and eventually Fabrizio grapple with what happened that night. A standout work of character-driven crime fiction from a celebrated author of the form, SAINT OF THE NARROWS STREET is a searing and richly drawn novel about the choices we make and how they shape our lives."
    },
    {
        "title": "Seeking Shelter: A Working Mother, Her Children, and a Story of Homelessness in America",
        "author": "Jeff Hobbs",
        "genres": [
            "Biography",
            "Nonfiction",
            "Social Sciences"
        ],
        "review": " From the bestselling author of THE SHORT AND TRAGIC LIFE OF ROBERT PEACE, a powerful portrayal of American homelessness that follows a single mother of six in Los Angeles courageously struggling to keep her family together and her children in school amidst the devastating housing crisis. In the tradition of EVICTED and INVISIBLE CHILD, Jeff Hobbs masterfully explores America’s housing crisis through the real-life story of Evelyn. This is Hobbs’ first book since THE SHORT AND TRAGIC LIFE OF ROBERT PEACE that focuses on a single character and her extraordinarily illuminating journey. In 2018, poverty and domestic violence cast Evelyn and her children into the urban wilderness of Los Angeles, where she avoids the family crisis network that offers no clear pathway for her children to remain together and in a decent school. For the next five years, Evelyn works full time as a waitress yet remains unable to afford legitimate housing or qualify for government aid. All the while she strives to provide stability, education, loving memories and college aspirations for her children even as they sleep in motels and in her car, living in fear of both her ex and the nation’s largest child welfare agency. Eventually Evelyn encounters Wendi Gaines, a recently trained social worker who decades earlier survived her own abusive marriage and housing crisis. Evelyn becomes one of Wendi’s first clients, and the relationship transforms them both. Told from the perspectives of Evelyn, Wendi, and Evelyn’s teenage son, Orlando, SEEKING SHELTER is a powerful and urgent exploration of the issues of homelessness, poverty and education in America --- a must-read for anyone interested in understanding not just social inequality and economic disparity in our society but also the power of a mother’s love and vision for her kids."
    },
    {
        "title": "Source Code: My Beginnings",
        "author": "Bill Gates",
        "genres": [
            "Memoir",
            "Nonfiction"
        ],
        "review": " The origin story of one of the most influential and transformative business leaders and philanthropists of the modern age. The business triumphs of Bill Gates are widely known: the 20-year-old who dropped out of Harvard to start a software company that became an industry giant and changed the way the world works and lives; the billionaire many times over who turned his attention to philanthropic pursuits to address climate change, global health and U.S. education.\n\t \n\tSOURCE CODE is not about Microsoft or the Gates Foundation or the future of technology. It’s the human, personal story of how Bill Gates became who he is today: his childhood, his early passions and pursuits. It’s the story of his principled grandmother and ambitious parents, his first deep friendships and the sudden death of his best friend; of his struggles to fit in and his discovery of a world of coding and computers in the dawn of a new era; of embarking in his early teens on a path that took him from midnight escapades at a nearby computer center to his college dorm room, where he sparked a revolution that would change the world.\n\t \n\tBill Gates tells this, his own story, for the first time. Wise, warm and revealing, it’s a fascinating portrait of an American life."
    },
    {
        "title": "Sweet Nothings: Confessions of a Candy Lover",
        "author": "Sarah Perry",
        "genres": [
            "Essays",
            "Humor",
            "Nonfiction"
        ],
        "review": " A fun, sophisticated illustrated collection of essays that catalogs the simple and not-so-simple pleasures of the eclectic world of candy from the award-winning author of AFTER THE ECLIPSE. With illustrations by Forsyth Harmon. A taxonomy of sweetness, a rhapsody of artificial flavors, and a multi-faceted theory of pleasure, SWEET NOTHINGS is made up of 100 illustrated micro essays organized by candy color, from the red of Pop Rocks to the purple Jelly Bonbon in the Whitman’s Sampler. Each entry is a meditation on taste and texture, a memory unlocked. Everyone’s favorites --- and least favorites --- are carefully considered, including Snickers and Trader Joe’s Peanut Butter Cups, as well as the beloved Good n’ Plenty and Werther’s Originals. An expert guide and exquisite writer, Sarah Perry asks such pressing questions as: Twizzlers or Red Vines? Why are Mentos eaters so maniacally happy? And in THE LION, THE WITCH AND THE WARDROBE, how could Edmund sell out his siblings for, of all things, Turkish delight? She rejects the dreaded “What is your favorite candy?” question and counters: Under what circumstances? The question itself is flawed --- favorite under what circumstances? In what weather? On the road, or at home? In what mood? For candy is inextricably tied to the seasons of our lives. SWEET NOTHINGS moves associatively, touching on pop culture, art, culinary history, philosophy, body image and class-based food moralism. It challenges the very idea of “junk” food and posits taking pleasure seriously as a means of survival. Sarah Perry’s pure love of candy weaves together elegiac glimpses of her '90s childhood --- and the loss at its center --- with stories of love and desire. Surprisingly smart and frequently funny, SWEET NOTHINGS is a tart and sweet ode to finding small joys where you can. Yes, even in black licorice."
    },
    {
        "title": "The Ghosts of Rome",
        "author": "Joseph O'Connor",
        "genres": [
            "Fiction",
            "Historical Fiction",
            "Historical Thriller",
            "Suspense",
            "Thriller"
        ],
        "review": " In the final months of World War II, a clandestine group known as The Choir successfully smuggles thousands of escapees out of Nazi-occupied Rome via a secret route known as the Escape Line. When an unidentified airman falls wounded from the sky, The Choir is plunged into danger, and the survival of the Escape Line itself is threatened. The Escape Line’s collapse would leave thousands stranded. Monsignor Hugh O’Flaherty, its architect and the acknowledged leader of The Choir, broods inside the Vatican, paralyzed by the perils of keeping his Roman underground railroad functioning. Meanwhile, SS Commander Paul Hauptmann has been tasked with destroying the entire operation, and the price of failure is high --- his wife and children are under Gestapo lock-and-key in Berlin. Into this deliriously thrilling melee steps Contessa Giovanna Landini, a reckless, audacious and magnetic member of the Italian Resistance who has the nerve to challenge Hauptmann’s authority. Beautifully written and expertly crafted, THE GHOSTS OF ROME is a historical suspense novel bursting with action, atmosphere and unforgettable characters by one of contemporary fiction’s most acclaimed and beloved writers."
    },
    {
        "title": "The Lamb",
        "author": "Lucy Rose",
        "genres": [
            "Fiction",
            "Gothic",
            "Horror"
        ],
        "review": " From an incendiary new talent, a contemporary queer folktale about a mother and daughter living in the woods, for fans of Angela Carter, Margaret Atwood and Julia Armfield. Margot and Mama have lived by the forest ever since Margot can remember. When Margot is not at school, they spend quiet days together in their cottage, waiting for strangers to knock on their door. Strays, Mama calls them. People who have strayed too far from the road. Mama loves the strays. She feeds them wine and keeps them warm. Then she satisfies her burning appetite by picking apart their bodies. But Mama’s want is stronger than her hunger sometimes. And when a beautiful, white-toothed stray named Eden turns up in the heart of a snowstorm, Margot must confront the shifting dynamics of her family, untangle her own desires, and make her bid for freedom. With this gothic coming-of-age tale, debut novelist Lucy Rose explores how women swallow their anger, desire and animal instincts --- and wrings the relationship between mother and daughter until blood drips from it."
    },
    {
        "title": "The Mother Next Door: Medicine, Deception, and Munchausen by Proxy",
        "author": "Andrea Dunlop",
        "genres": [
            "Nonfiction",
            "True Crime"
        ],
        "review": " A groundbreaking work of narrative nonfiction that investigates Munchausen by Proxy from the host and creator of the award-winning true crime podcast \"Nobody Should Believe Me.\" No bond is more sacred than that between a mother and child. And no one is more sympathetic than a mother whose child faces a life-threatening illness. But what if the mother is the cause of the illness? What if the sympathy is the point? Munchausen by proxy (MBP) has fascinated and horrified both professionals and the general public since this disturbing form of child abuse was first identified. But even as the public has been captivated by these tales of abuse and deception, there remains widespread misinformation and confusion about MBP. Are these mothers unfeeling psychopaths, or sick women who need help? And more important, how can we protect the children whose lives are at stake? THE MOTHER NEXT DOOR offers a groundbreaking look at MBP from an unlikely duo: a Seattle novelist whose own family was torn apart by it, and the Texas detective who has worked on more medical child abuse cases than anyone in the nation. Readers ride along on three high-stakes MPB investigations; through riveting reporting and shocking stories from the family members, friends and doctors caught in the blast zone of these unthinkable acts, a twisted portrait of motherhood and deceit is revealed. With help from some of the top MBP experts in the world, Dunlop and Weber uncover the complex maze of psychological, systemic and cultural issues that compound MBP and offer solutions for how we might find our way out."
    },
    {
        "title": "The Snowbirds",
        "author": "Christina Clancy",
        "genres": [
            "Fiction",
            "Women's Fiction"
        ],
        "review": " THE LAST THING HE TOLD ME meets FLEISHMAN IS IN TROUBLE in this page-turning story of a couple who flees winter in the Midwest for Palm Springs, where they find their relationship at a crossroads. Kim and Grant are at a turning point. A couple for 30 years, their \"separate but together\" partnership is running up against the realities of late middle age: Grant’s mother has died, the college where he taught philosophy was shuttered, and their twin girls are grown and gone. Escaping the bitter cold of a Midwestern winter for the hot desert sun of Palm Springs seems as good a solution as any to the more intractable problems they face. When they arrive at Le Desert, a quirky condo community where everyone knows everyone’s business, Kim immediately embraces the opportunity to make new friends and explore a more adventurous side of her personality. Meanwhile, Grant struggles to find his footing in this unfamiliar landscape, leaving Kim to wonder if their relationship can survive the snowbird season. But when Grant goes missing on a hike in the Palm Springs mountains, Kim is forced to consider two terrifying outcomes: either Grant is truly lost, or this time, he’s really left her. Is it ever too late to become the person we wanted to be --- and is there still time to change into someone better? The exhilarating but often confusing transitions of midlife are pitched against the promise and glamour of Palm Springs in this tender, honest story of what it takes to commit to someone for a lifetime. With compassion and humor, Clancy explores the redemptive power of finding ourselves, and of being found."
    },
    {
        "title": "This Is a Love Story",
        "author": "Jessica Soffer",
        "genres": [
            "Fiction"
        ],
        "review": " An intimate and lyrical celebration of great love, great art, and the sacrifices we make for both. For 50 years, Abe and Jane have been coming to Central Park, as starry-eyed young lovers, as frustrated and exhausted parents, as artists watching their careers take flight. They came alone when they needed to get away from each other, and together when they had something important to discuss. The Park has been their witness for half a century of love. Until now. Jane is dying, and Abe is recounting their life together as a way of keeping them going: the parts they knew --- their courtship and early marriage, their blossoming creative lives --- and the parts they didn’t always want to know --- the determined young student of Abe’s looking for a love story of her own, and their son, Max, who believes his mother chose art over parenthood and who has avoided love and intimacy at all costs. Told in various points of view, even in conversation with Central Park itself, these voices weave in and out to paint a portrait as complicated and essential as love itself. An homage to New York City, to romance and even to loss, THIS IS A LOVE STORY tenderly and suspensefully captures deep truths about life and marriage in radiant prose. It is about love that endures despite what life throws at us, or perhaps even because of it."
    },
    {
        "title": "Victorian Psycho",
        "author": "Virginia Feito",
        "genres": [
            "Fiction",
            "Gothic",
            "Horror",
            "Humor"
        ],
        "review": " From the acclaimed author of MRS. MARCH comes the riveting tale of a bloodthirsty governess who learns the true meaning of vengeance. Virginia Feito’s MRS. MARCH was hailed as “a brilliant debut...[by] a writer who keeps pace with the grandees she invokes” (Sarah Ditum, Guardian) --- from Daphne Du Maurier and Shirley Jackson to Patricia Highsmith. Now, Feito returns with her “silver-polish sentences and her eerie psychological acumen” (Constance Grady, Vox) to unleash an entirely new antihero on us all. Grim Wolds, England: Winifred Notty arrives at Ensor House prepared to play the perfect governess. She’ll dutifully tutor her charges, Drusilla and Andrew, tell them bedtime stories, and only joke about eating children. But long, listless days spent within the estate’s dreary confines come with an intimate knowledge of the perversions and pathetic preoccupations of the Pounds family. Mr. Pounds can’t keep his eyes off Winifred’s chest, and Mrs. Pounds takes a sickly pleasure in punishing Winifred for her husband’s wandering gaze. Compounded with her disdain for the entitled Pounds children, Winifred finds herself struggling at every turn to stifle the violent compulsions of her past. French tutoring and needlework are one way to pass the time, as is admiring the ugly portraits in the gallery...and creeping across the moonlit lawns. Patience. Winifred must have patience, for Christmas is coming, and she has very special gifts planned for the dear souls of Ensor House. Brimming with sardonic wit and culminating in a shocking conclusion, VICTORIAN PSYCHO plunges readers into the chilling mind of an iconic new literary psychopath."
    },
    {
        "title": "Who I Always Was: A Memoir",
        "author": "Theresa Okokon",
        "genres": [
            "Essays",
            "Memoir",
            "Nonfiction"
        ],
        "review": " For fans of AFTERSHOCKS and HOW TO SLOWLY KILL YOURSELF AND OTHERS IN AMERICA, a gripping and deeply honest memoir in essays, this debut collection sets out to answer the universal question of: Why am I like this? When Theresa Okokon was nine, her father traveled to his hometown in Nigeria to attend his mother’s funeral…and never returned. His mysterious death shattered Theresa as her family’s world unraveled. Now a storyteller and television cohost, Okokon sets out to explore the ripple effects of that profound loss and the way heartache shapes our sense of self and of the world --- for the rest of our lives. Using her grief and her father’s death as a backdrop, Okokon delves deeply into intrinsic themes of Blackness, African spirituality, family, abandonment, belonging, and the seemingly endless, unrequited romantic pursuits of a Black woman who came of age as a Black girl in the Wisconsin suburbs where she was --- in many ways --- always an anomaly."
    },
    {
        "title": "Paranoia: A Michael Bennett Thriller",
        "author": "James Patterson",
        "genres": [
            "Fiction",
            "Psychological Suspense",
            "Psychological Thriller",
            "Suspense",
            "Thriller"
        ],
        "review": " NYPD Detective Michael Bennett will stop at nothing to protect family: his wife, his kids --- and his fellow officers --- in the latest psychological thriller from bestselling author James Patterson. At every death scene, NYPD Detective Michael Bennett says a prayer over the victim. But recently, too many of the departed have been fellow cops. “I want you to look at these deaths on special assignment,” NYPD Inspector Celeste Cantor says. “Report only to me.” Bennett excels as a solo investigator. But he's chasing a killer who feeds on isolation...and paranoia."
    },
    {
        "title": "A Girl Like Us",
        "author": "Anna Sophia McLoughlin",
        "genres": [
            "Fiction",
            "Suspense",
            "Thriller"
        ],
        "review": " \"Succession\" meets Saltburn in a crackling locked-room thriller of inconceivable wealth, unchecked power and the secrets poised to bring a powerful family down. It's 2004, and former reality TV star and party girl Maya Miller has just married the most eligible bachelor on the planet: Colin Sterling, of the globally famous Sterling family, whose history of aristocratic titles and land holdings rival a British royal and whose media empire is comparable to the Murdochs. To some, Maya represents the American dream. To others, a gold digger. But when Colin's cousin Arianna, the heiress to the family's immense fortune, is found murdered, Maya is thrust into the spotlight: first as she is revealed to be the next heiress to the fortune, and then as the prime suspect. Swiftly, the entire Sterling family goes into lockdown at Silver House, the family's ancestral estate in the English countryside. They're told it's for their own safety --- but Maya becomes convinced that it's not to keep threats out, but to keep secrets in. Now, she has no choice but to find and expose the truth hidden within the Sterling family, and why Arianna, a girl she had never met, chose her to take her place. But Maya has secrets of her own. And she knows that in order to survive the Sterlings, she'll have to beat them at their own game."
    },
    {
        "title": "Beartooth",
        "author": "Callan Wink",
        "genres": [
            "Fiction"
        ],
        "review": " Two brothers in dire straits, living on the edge of Yellowstone, agree to a desperate act of survival in this taut, propulsive novel reminiscent of the works of Peter Heller and Donald Ray Pollock. In an aging timber house hand-built into the Absaroka-Beartooth mountains, two brothers are struggling to keep up with their debts. They live off the grid, on the fringe of Yellowstone, surviving off the wild after the death of their father. Thad, the elder, is more capable of engaging with things like the truck registration, or the medical bills they can’t afford from their father’s fatal illness, or the tax lien on the cabin their grandfather built, while Hazen is…different, more instinctual, and deeply in tune with the natural world. Desperate for money, they are approached by a shadowy out-of-towner with a dangerous proposition that will change both of their lives forever. BEARTOOTH is a fast-paced tale with moments of surprising poignancy set in the grandeur of the American West. Evoking the timeless voices of American pastoral storytelling, this is a bracing, masterful novel about survival, revenge and the bond between brothers."
    },
    {
        "title": "Blood Ties",
        "author": "Jo Nesbø",
        "genres": [
            "Fiction",
            "Noir",
            "Suspense",
            "Thriller"
        ],
        "review": " From the modern master of Nordic suspense comes an explosive novel about a community in crisis and two brothers on the verge of losing everything they’ve worked so hard to achieve. By all accounts, Carl and Roy Opgard are doing quite well for themselves. Or at least they’re doing as well as can be expected in a small town like Os. Carl manages the area’s swanky and successful spa and hotel, while Roy runs a nearby gas station and harbors grand plans to build it out into an entire amusement park, complete with a roller coaster. But when news breaks about a new highway to be built nearby, bypassing Os and leaving the town cutoff and isolated, it’s clear that something has to be done…even if the methods are bound to be dirty. Fortunately, Carl and Roy have experience with just that kind of work. Meanwhile, the town sheriff has gotten his hands on new technology that will enable him to take a deeper look at a slate of unsolved murders from years past --- including that of his own father. And just as the sheriff reopens his investigation, the death toll begins to climb. It’s like Roy says about his roller coaster: “Once it’s rolling, it’s too late to get off.” BLOOD TIES is a tense, compulsively readable tour de force about loyalty, family ties and love that is as destructive as it is powerful."
    },
    {
        "title": "Casualties of Truth",
        "author": "Lauren Francis-Sharma",
        "genres": [
            "Fiction",
            "Women's Fiction"
        ],
        "review": " From the author of BOOK OF THE LITTLE AXE, nominated for the Hurston/Wright Legacy Award, and the critically acclaimed 'TIL THE WELL RUNS DRY, a riveting literary novel with the sharp edges of a thriller about the abuses of history and the costs of revenge, set between Washington, D.C., and Johannesburg, South Africa. Prudence Wright seems to have it all: a loving husband, Davis; a spacious home in Washington, D.C.; and the former glories of a successful career at McKinsey, which now enables her to dedicate her days to her autistic son, Roland. When she and Davis head out for dinner with one of Davis’ new colleagues on a stormy summer evening filled with startling and unwelcome interruptions, Prudence has little reason to think that certain details of her history might arise sometime between cocktails and the appetizer course. Yet when Davis’ colleague turns out to be Matshediso, a man from Prudence’s past, she is transported back to the formative months she spent as a law student in South Africa in 1996. As an intern at a Johannesburg law firm, Prudence attended sessions of the Truth and Reconciliation hearings that uncovered the many horrors and human rights abuses of the Apartheid state, and which fundamentally shaped her sense of righteousness and justice. Prudence experienced personal horrors in South Africa as well, long hidden and now at risk of coming to light. When Matshediso finally reveals the real reason behind his sudden reappearance, he will force Prudence to examine her most deeply held beliefs and excavate inner reserves of resilience and strength. Lauren Francis-Sharma’s previous two novels have established her as a deft chronicler of history and its intersections with flawed humans struggling to find peace in unjust circumstances. With keen insight and gripping tension, CASUALTIES OF TRUTH explosively mines questions of whether we are ever truly able to remove the stains of our past and how we may attempt to reconcile with unquestionable wrongs."
    },
    {
        "title": "Every Tom, Dick & Harry",
        "author": "Elinor Lipman",
        "genres": [
            "Comedy",
            "Fiction",
            "Humor",
            "Romance",
            "Women's Fiction"
        ],
        "review": " From the author of MS. DEMEANOR --- one of the most beloved comedic writers of our time --- comes a charming, laugh-out-loud tale of love and criminality, a pitch-perfect romantic comedy. Taking over her parents’ estate-sale business is not the life’s work that Emma Lewis bargained for. Yes, she grew up helping them empty people’s nests, but nothing prepared her for her biggest and stickiest “get” --- the grand, beautiful house of ill repute masquerading as a decidedly beddable B&B. Should Emma turn down potential clients in need of decluttering just because they are shady, escort-y and proud of it? No. A girl must make a living. Around some hairpin turns, Elinor Lipman ingeniously reveals a straight shot to happiness."
    },
    {
        "title": "Idle Grounds",
        "author": "Krystelle Bamford",
        "genres": [
            "Fiction",
            "Magical Realism"
        ],
        "review": " On a New England morning in the late 1980s, a group of young cousins wander deep into the woods on their family’s property, drawn in by uncanny visions and the disappearance of one of their own --- but the farther they go, the stranger their surroundings become. Lingering at the edge of a family party, a troop of cousins loses track of the youngest child among them. With their parents preoccupied with bickering about decades-old crises, the children decide they must set out to investigate themselves --- to the rickety chicken coop, the barn and its two troublesome horses, and into the woods that once comprised their late grandmother’s property. The more the children search, and the deeper they walk, the more threatening the woods become and the more lost they are, caught between their aunt’s home in the present day, their parents’ childhood home just through the trees and the memory of the house their grandmother grew up in. Soon, what began as a quest for answers gives way to a journey that undermines everything they’ve been told about who they are, where they came from and what they deserve. Disquieting and delightful, IDLE GROUNDS is a rich exploration of the interior lives of children and a gripping meditation on birthright, decline and weight of family history. A fable of the distortions of privilege and the impossibility of keeping secrets hidden, this is a novel about straying from home --- only to come back unraveled, unsettled and irrevocably changed."
    },
    {
        "title": "Nemesis: An Orphan X Novel",
        "author": "Gregg Hurwitz",
        "genres": [
            "Fiction",
            "Suspense",
            "Thriller"
        ],
        "review": " No greater friend. No deadlier enemy. The explosive new novel in the New York Times bestselling Orphan X series is flipping the acclaimed series on its head. Find out why series superfans and new readers alike are calling it a “knockout” (firstCLUE). Evan Smoak is a highly trained former government assassin who has survived for years by keeping his circle to a few trusted confidants and a strict code he calls “The Ten Commandments.” But when Evan suddenly finds himself at odds with his oldest friend, all the rules he lives by shatter --- and the consequences are murderous. Tommy Stojack might be Evan's best friend in the world. He is a gifted gunsmith who has created much of Evan's own weapons and combat gear. But now he apparently has crossed one of Evan's hardest lines, and their argument explodes into open warfare. Now Evan has no choice but to track and face down his only friend. In the meantime, Tommy has left town in order to honor his own promise to help a dead friend's son. While Tommy is fighting to save the son with everything he’s got, Evan arrives with vengeance in mind. But as deadly as the former Orphan X is, there is an even more dangerous threat about to arrive on the scene. The only question left is: Will any of them get out alive?"
    },
    {
        "title": "People of Means",
        "author": "Nancy Johnson",
        "genres": [
            "Fiction",
            "Historical Fiction",
            "Women's Fiction"
        ],
        "review": " From the acclaimed author of THE KINDEST LIE, a propulsive novel about a mother and daughter each seeking justice and following their dreams during moments of social reckoning --- 1960s Nashville and 1992 Chicago. Perfect for readers of Brit Bennett and Tayari Jones. Two women. Two pivotal moments. One dream for justice and equality. In the fall of 1959, Freda Gilroy arrives on the campus of Fisk University full of hope, carrying a suitcase and the voice of her father telling her she’s part of a family legacy of greatness. Soon, the ugliness of the Jim Crow South intrudes, and she’s thrust into a movement for social change. Freda is reluctant to get involved, torn between a soon-to-be doctor her parents approve of and an audacious young man willing to risk it all in the name of justice. Freda finds herself caught between two worlds, and two loves, and must decide how much she’s willing to sacrifice for the advancement of her people. In 1992 Chicago, Freda’s daughter, Tulip, is an ambitious PR professional on track for an exciting career, if workplace politics and racial microaggressions don’t get in her way. But with the ruling in the Rodney King trial weighing heavily on her, Tulip feels called to action. When she makes an irreversible professional misstep as she seeks to uplift her community, she must decide, just like her mother had three decades prior, what she’s willing to risk in the name of justice and equality. Insightful, evocative and richly imagined with stories of hidden history, PEOPLE OF MEANS is an emotional tour de force that offers a glimpse into the quest for racial equality, the pursuit of personal and communal success, and the power of love and family ties."
    },
    {
        "title": "Smoke on the Water: An Amos Walker Mystery",
        "author": "Loren D. Estleman",
        "genres": [
            "Fiction",
            "Historical Fiction",
            "Historical Mystery",
            "Mystery"
        ],
        "review": " From the master of the hard-boiled detective novel and recipient of the Private Eye Writers of America Lifetime Achievement Award comes Loren D. Estleman's next enthralling Amos Walker mystery SMOKE ON THE WATER. As the smoke from Canadian wildfires chokes Detroit, PI Amos Walker is tasked with investigating a fatal hit-and-run. The victim is Spencer Bennett, a junior law associate with the Waterford Group, and he supposedly had a file of confidential documents on him when he died. But those documents have now gone missing, and the firm is dead set on Walker finding them. As Walker digs deeper into the events leading to Bennett's death, all signs are pointing towards the crash being anything but accidental. Summer in Detroit was hot enough before the smoke descended, but as the temperature rises and more bodies crop up in connection to the missing file, Walker will have to track down those documents --- and unearth why they were worth killing over --- before it's too late."
    },
    {
        "title": "Stone Yard Devotional",
        "author": "Charlotte Wood",
        "genres": [
            "Fiction",
            "Women's Fiction"
        ],
        "review": " Shortlisted for the 2024 Booker Prize, a novel about forgiveness, grief and what it means to be good, from the award-winning author of THE WEEKEND. Burnt out and in need of retreat, a middle-aged woman leaves Sydney to return to the place she grew up, taking refuge in a small religious community hidden away on the stark plains of rural Australia. She doesn't believe in God, or know what prayer is, and finds herself living this strange, reclusive existence almost by accident. But disquiet interrupts this secluded life with three visitations. First comes a terrible mouse plague, each day signaling a new battle against the rising infestation. Second is the return of the skeletal remains of a sister who disappeared decades before, presumed murdered. And finally, a troubling visitor plunges the narrator further back into her past. Meditative, moving and finely observed, STONE YARD DEVOTIONAL is a seminal novel from a writer of rare power, exploring what it means to retreat from the world, the true nature of forgiveness, and the sustained effect of grief on the human soul."
    },
    {
        "title": "The American No: Stories",
        "author": "Rupert Everett",
        "genres": [
            "Fiction",
            "Short Stories"
        ],
        "review": " Eight masterful stories of love and loss, drama and glamour, and hope and rejection from the acclaimed actor and “supremely gifted writer” (The Sunday Times, London) Rupert Everett. In his first, glorious collection of stories, Rupert Everett takes us on exhilarating journeys with a cast of extraordinary characters. From Oscar Wilde’s last night in Paris to the ferociously unforgiving world of a Los Angeles talent agency and beyond, these stories are evocative, moving and tender. Brilliantly witty, elegiac, and drawing from the wealth of film and TV ideas Everett has worked on over the course of his illustrious career, THE AMERICAN NO will delight and surprise his many fans."
    },
    {
        "title": "The Dollhouse Academy",
        "author": "Margarita Montimore",
        "genres": [
            "Fiction",
            "Suspense",
            "Thriller",
            "Women's Fiction"
        ],
        "review": " From the national bestselling author of the \"GMA\" Book Club pick OONA OUT OF ORDER, a novel about two best friends and aspiring actresses who join the Dollhouse Academy, where stars are made and dangerous secrets are hidden. Ivy Gordon is living on borrowed time. For the past 18 years, she has been the most famous star at the Dollhouse Academy, the elite boarding school and talent incubator that every aspiring performer dreams of attending. But now, at age 34, she is tired of pretending everything is fine. In secret diary entries, Ivy begins to reveal the truth of her life at the Dollhouse: strange medical exams, mysterious supplements, and something unspeakable that has left Ivy terrified and feeling like a prisoner. Ramona Halloway and her best friend, Grace Ludlow, grew up idolizing Ivy. Now both 22, neither has made much headway in showbiz until a lucky break grants them entry to the Dollhouse. They’re enchanted by the picturesque campus and the chance to perform alongside their idols. When Ramona begins to receive threatening anonymous messages, it’s easy to dismiss them as a prank from a rival. Her bigger concern is Grace’s skyrocketing success, while Ramona struggles to keep up with the fierce competition. As the messages grow more unsettling, so does life at the Dollhouse. Can Ramona overcome her jealousy and resentment to figure out what’s really going on? Will Ivy finally find her voice, before another young performer follows her catastrophic path? With dark academia twists and enormous heart, THE DOLLHOUSE ACADEMY is a novel about the complexities of friendship, our desire to be seen and understood, and the true cost of making our dreams a reality."
    },
    {
        "title": "The Medici Return: A Cotton Malone Novel",
        "author": "Steve Berry",
        "genres": [
            "Fiction",
            "Suspense",
            "Thriller"
        ],
        "review": " From celebrated New York Times bestselling author Steve Berry comes the latest installment in his wildly popular Cotton Malone series --- now in development as a streaming series. THE MEDICI RETURN takes Cotton to Italy to solve a 500-year-old mystery. Cotton Malone is on the hunt for a forgotten 16th-century Pledge of Christ --- a sworn promise made by Pope Julius II that evidences a monetary debt owed by the Vatican, still valid after five centuries --- now worth in the trillions of dollars. But collecting that debt centers around what happened to the famed Medici of Florence --- a family that history says died out, without heirs, centuries ago. Who will become the next prime minister of Italy, and who will be the next pope? Finding answers proves difficult until Cotton realizes that everything hinges on when, and if, the Medici return."
    },
    {
        "title": "The Queens of Crime",
        "author": "Marie Benedict",
        "genres": [
            "Fiction",
            "Historical Fiction",
            "Historical Mystery",
            "Mystery",
            "Women's Fiction"
        ],
        "review": " The New York Times bestselling author of THE MYSTERY OF MRS. CHRISTIE returns with a thrilling story of Agatha Christie’s legendary rival, Dorothy Sayers; the race to solve a murder; and the power of friendship among women. London, 1930. The five greatest women crime writers have banded together to form a secret society with a single goal: to show they are no longer willing to be treated as second-class citizens by their male counterparts in the legendary Detection Club. Led by the formidable Dorothy L. Sayers, the group includes Agatha Christie, Ngaio Marsh, Margery Allingham and Baroness Emma Orczy. They call themselves the Queens of Crime. Their plan? Solve an actual murder, that of a young woman found strangled in a park in France who may have connections leading to the highest levels of the British establishment. May Daniels, a young English nurse on an excursion to France with her friend, seemed to vanish into thin air as they prepared to board a ferry home. Months later, her body is found in the nearby woods. The murder has all the hallmarks of a locked room mystery for which these authors are famous. How did her killer manage to sneak her body out of a crowded train station without anyone noticing? If, as the police believe, the cause of death is manual strangulation, why is there is an extraordinary amount of blood at the crime scene? What is the meaning of a heartbreaking secret letter seeming to implicate an unnamed paramour? Determined to solve the highly publicized murder, the Queens of Crime embark on their own investigation, discovering they’re stronger together. But soon the killer targets Dorothy Sayers herself, threatening to expose a dark secret in her past that she would do anything to keep hidden. Inspired by a true story in Sayers’ own life, New York Times bestselling author Marie Benedict brings to life the lengths to which five talented women writers will go to be taken seriously in the male-dominated world of letters as they unpuzzle a mystery torn from the pages of their own novels."
    },
    {
        "title": "The Wolf Tree",
        "author": "Laura McCluskey",
        "genres": [
            "Fiction",
            "Gothic",
            "Mystery"
        ],
        "review": " Eilean Eadar is a barren, windswept rock best known for the unsolved mystery of the three lighthouse keepers who vanished back in 1919. But when a young man is found dead at the base of that same lighthouse, two detective inspectors are sent from Glasgow to investigate. Georgina “George” Lennox is happy to be back from leave after a devastating accident. That is, until she meets the hostile islanders and their enigmatic priest, who seem determined to thwart their investigation. George’s partner, Richie, just wants to close the case and head home to his family. But he hasn’t heard the wolves howling or seen the dark figures at their window at night. He’s too busy watching George as if waiting for her to break. With the dark secrets of the island swirling around them, George and Richie must decide who to trust and what to believe as they spin closer to the terrible truth. Laced with Scottish legend yet sharp and modern in voice, THE WOLF TREE announces a spellbinding new voice in crime and mystery fiction."
    },
    {
        "title": "Three Days in June",
        "author": "Anne Tyler",
        "genres": [
            "Fiction",
            "Women's Fiction"
        ],
        "review": " A new Anne Tyler novel destined to be an instant classic: a socially awkward mother of the bride navigates the days before and after her daughter's wedding. Gail Baines is having a bad day. To start, she loses her job --- or quits, depending on whom you ask. Tomorrow her daughter, Debbie, is getting married, and she hasn’t even been invited to the spa day organized by the mother of the groom. Then, Gail’s ex-husband, Max, arrives unannounced on her doorstep, carrying a cat, without a place to stay and without even a suit. But the true crisis lands when Debbie shares with her parents a secret she has just learned about her husband to be. It will not only throw the wedding into question but also stir up Gail and Max’s past. Told with deep sensitivity and a tart sense of humor, full of the joys and heartbreaks of love and marriage and family life, THREE DAYS IN JUNE is a triumph and gives us the perennially bestselling, Pulitzer Prize–winning writer at the height of her powers."
    },
    {
        "title": "Waiting for the Long Night Moon: Stories",
        "author": "Amanda Peters",
        "genres": [
            "Fiction",
            "Short Stories"
        ],
        "review": " In her debut collection of short fiction, Amanda Peters describes the Indigenous experience from an astonishingly wide spectrum in time and place --- from contact with the first European settlers, to the forced removal of Indigenous children, to the present-day fight for the right to clean water. In this intimate collection, Amanda Peters melds traditional storytelling with beautiful, spare prose to describe the dignity of the traditional way of life, the humiliations of systemic racism and the resilient power to endure. A young man returns from residential school only to realize he no longer can communicate with his own parents. A grieving mother finds purpose and healing on the front lines as a water protector. And a nervous child dances in her first Mawi’omi. The collection also includes the Indigenous Voices Award-winning and title story “Waiting for the Long Night Moon.” At times sad, sometimes disturbing but always redemptive, the stories in WAITING FOR THE LONG NIGHT MOON will remind you that where there is grief there is also joy, where there is trauma there is resilience and, most importantly, there is power."
    },
    {
        "title": "We All Live Here",
        "author": "Jojo Moyes",
        "genres": [
            "Fiction",
            "Women's Fiction"
        ],
        "review": " The #1 New York Times bestselling author, whose books so many love, brings us a fresh, contemporary story of a woman and her unruly blended family. Lila Kennedy has a lot on her plate. A broken marriage, two wayward daughters, a house that is falling apart, and an elderly stepfather who seems to have quietly moved in. Her career is in freefall, and her love life is…complicated. So when Lila’s real dad --- a man she barely has seen since he ran off to Hollywood 35 years ago --- suddenly appears on her doorstep, it feels like the final straw. But it turns out even the family you thought you could never forgive might have something to teach you: about love, and what it actually means to be family."
    },
    {
        "title": "We Would Never",
        "author": "Tova Mirvis",
        "genres": [
            "Fiction",
            "Women's Fiction"
        ],
        "review": " A riveting literary page-turner that maps the extremes to which a family will go in order to protect their own. No one appears more surprised than Hailey Gelman when she comes under suspicion for the murder of her soon-to-be ex-husband, Jonah. Hailey --- nicknamed Sunshine by her mother for her bright outlook and ever-present smile --- has always tried to do what is expected of her and is regarded as the family peacemaker. But is anyone, including Hailey, who she has always seemed to be? The months leading up to Jonah’s death have been fraught, including a bitter separation and a messy custody battle over their young daughter, Maya. When Hailey files a motion to relocate to Florida so she can be near her family, Jonah retaliates and the divorce begins to spiral dangerously out of control. Sherry, Hailey’s mother, will stop at almost nothing to keep Jonah from getting what he wants. Nate, Hailey’s impetuous and protective older brother, has tried to keep his distance, but he can’t stand to see his little sister suffer. And then there’s Solomon, the patriarch, who is keeping a secret that threatens the stability and security Sherry has worked so hard to maintain. Soon, they are forced to reckon with who they are as individuals and as a family, and just how far they will go for each other. Inspired by a true story, WE WOULD NEVER is a gripping mystery, an intimate family drama, and a provocative exploration of loyalty, betrayal, and the blurred line between protecting and forsaking the ones we love most."
    },
    {
        "title": "You Are Fatally Invited",
        "author": "Ande Pliego",
        "genres": [
            "Fiction",
            "Mystery",
            "Psychological Suspense",
            "Psychological Thriller",
            "Suspense",
            "Thriller"
        ],
        "review": " An exclusive thriller writer’s retreat hosted on a private island turns lethal when one of the authors is found murdered. When renowned anonymous author J.R. Alastor hires former aspiring writer Mila del Angél to host a writing retreat at his private manor off the coast of Maine, she jumps at the chance --- particularly since she has an axe to grind with one of the invitees. The guest list? Six thriller authors, all masters of deceit, misdirection and mayhem. Confess the crimes, survive the tropes. Alastor and Mila have masterminded a week of games, trope-fueled riddles, and maybe a jump scare or two --- the perfect cover for Mila to plot a murder of her own. But when a guest turns up dead --- and it’s not the murder she planned --- Mila finds herself trapped in a different narrative altogether. One by one, you’ll lose your turn. With a storm isolating the island, and the body count rising, Mila must outwit a killer who knows literally every trick in the book. Until only one of us remains..."
    },
    {
        "title": "A Dragon of Black Glass",
        "author": "James Rollins",
        "genres": [
            "Adventure",
            "Fantasy",
            "Fiction"
        ],
        "review": " The third and penultimate book in the New York Times bestselling Moonfall series from thriller-master James Rollins, A DRAGON OF BLACK GLASS is a tale of relentless adventure and the struggle for survival in a harsh world that hangs by a thread. What will they risk to save the world? With the apocalyptic threat of moonfall looming ever closer, Nyx and her allies must venture into the eternally sunblasted lands to search for an ancient weapon buried untold millennia ago. All the while, enemies close upon her flanks, and a greater danger lurks ahead. For beneath a desert turned to glass, hidden from the scorching heat, life thrives --- both wondrous and monstrous. But a more fearsome menace lies even deeper, where an ancient army has been seeded to protect a secret from any who dare seek it out. Yet, can Nyx truly trust those at her side? Or even herself? For while her gifts grow ever stronger, so does the danger of losing herself to a dark madness. Worst yet, the same afflicts Bashaliia, her winged and bonded brother. Elsewhere, a looming war explodes across the Crown, forging new alliances and greater enmities, as lands around the globe are drawn into fiery conflict. Prince Kanthe --- now consort to the newly crowned Empress of the Southern Klashe --- recognizes a hard truth: to save the world, he must destroy all that he once loved. Beyond such struggles, a new cunning peril smolders at the heart of a kingdom. Hidden in the Shrivenkeep of the Iflelen, an ancient bronze weapon has been awoken. Fed by blood, fueled by hatred, it has only one purpose: to end all life on Urth. But in this goal, will Nyx prove to be its ally or foe?"
    },
    {
        "title": "Cold as Hell: A Haven's Rock Novel",
        "author": "Kelley Armstrong",
        "genres": [
            "Fiction",
            "Mystery"
        ],
        "review": " New York Times bestselling author Kelley Armstrong returns to Haven’s Rock in COLD AS HELL as Casey Duncan hunts down a dangerous killer during a deadly blizzard. Haven’s Rock is a sanctuary town hidden deep in the Yukon for those who need to disappear from the regular world. Detective Casey Duncan and her husband, Sheriff Eric Dalton, are starting a family now that they’ve settled into their life here. As Casey nears the end of her pregnancy, she lets nothing, including her worried husband, stop her from investigating what happens in the forbidden forest outside the town of Haven’s Rock. When one of the town's residents is drugged and wanders too close to the edge of town, she’s dragged into the woods kicking and screaming. She’s saved in the nick of time, but the women of the town are alarmed. Casey and Eric investigate the assault just as a snowstorm hits Haven’s Rock, covering the forest. It’s there they find a frozen body, naked in the snow. With mixed accounts of the woman's last movements, the two begin to question who they can trust --- and who they can't --- in their seemingly safe haven."
    },
    {
        "title": "Death of a Smuggler: A Hamish Macbeth Murder Mystery",
        "author": "M. C. Beaton",
        "genres": [
            "Fiction",
            "Mystery"
        ],
        "review": " A murder, a missing man and his newest constable’s secret past are all that’s standing in the way of Sergeant Hamish Macbeth settling in for a relaxing winter in his sleepy Scottish village of Lochudch. All Hamish Macbeth ever really wants is a quiet life in the peaceful surroundings of his home in the Highland village of Lochdubh. Unfortunately for him, the time he would normally find most relaxing, after the tourists have gone and before the winter sets in, turns out to be far from peaceful. The new love in his life, Claire, is keen for them to take a holiday and Hamish is mulling over the idea when his newly-assigned constable arrives, presenting Hamish with both a surprise and a secret. Getting to the bottom of the secret becomes the least of Hamish’s problems when, at the opening of the revamped village pub, he meets a family who has a score to settle with a sinister man who has mysteriously gone missing. Discovering a murdered woman’s body puts further pressure on Hamish, especially when it becomes clear that the murdered woman and the missing man were linked, although their true identities become yet another mystery. To Hamish’s horror, he then finds himself working on the murder case with the despicable Detective Chief Inspector Blair, his sworn enemy, who has been drafted in under curious circumstances. With a growing list of suspects, ever more bewildering circumstances and Blair hindering him at every turn, Hamish must find the murderer before anyone else falls victim. Never has a quiet life seemed further from his grasp!"
    },
    {
        "title": "Jane Austen's Bookshelf: A Rare Book Collector's Quest to Find the Women Writers Who Shaped a Legend",
        "author": "Rebecca Romney",
        "genres": [
            "Literary Criticism",
            "Nonfiction"
        ],
        "review": " From rare book dealer and guest star of the hit show \"Pawn Stars,\" a page-turning literary adventure that introduces readers to the women writers who inspired Jane Austen --- and investigates why their books have disappeared from our shelves. Long before she was a rare book dealer, Rebecca Romney was a devoted reader of Jane Austen. She loved that Austen’s books took the lives of women seriously, explored relationships with wit and confidence and always allowed for the possibility of a happy ending. She read and reread them, often wishing Austen wrote just one more. But Austen wasn’t a lone genius. She wrote at a time of great experimentation for women writers --- and clues about those women, and the exceptional books they wrote, are sprinkled like breadcrumbs throughout Austen’s work. Every character in NORTHANGER ABBEY who isn’t a boor sings the praises of Ann Radcliffe. The play that causes such a stir in MANSFIELD PARK is a real one by the playwright Elizabeth Inchbald. In fact, the phrase “pride and prejudice” came from Frances Burney’s second novel, CECILIA. The women who populated Jane Austen’s bookshelf profoundly influenced her work; Austen looked up to them, passionately discussed their books with her friends and used an appreciation of their books as a litmus test for whether someone had good taste. So where had these women gone? Why hadn’t Romney --- despite her training --- ever read them? Or, in some cases, even heard of them? And why were they no longer embraced as part of the wider literary canon? JANE AUSTEN'S BOOKSHELF investigates the disappearance of Austen’s heroes --- women writers who were erased from the Western canon --- to reveal who they were, what they meant to Austen and how they were forgotten. Each chapter profiles a different writer including Frances Burney, Ann Radcliffe, Charlotte Lennox, Charlotte Smith, Hannah More, Elizabeth Inchbald, Hester Lynch Thrale Piozzi and Maria Edgeworth --- and recounts Romney’s experience reading them, finding rare copies of their works and drawing on connections between their words and Austen’s. Romney collects the once-famed works of these forgotten writers, physically recreating Austen’s bookshelf and making a convincing case for why these books should be placed back on the to-be-read pile of all book lovers today. JANE AUSTEN'S BOOKSHELF will encourage you to look beyond assigned reading lists, question who decides what belongs there, and build your very own collection of favorite novels."
    },
    {
        "title": "Midnight Black: A Gray Man Novel",
        "author": "Mark Greaney",
        "genres": [
            "Fiction",
            "Suspense",
            "Thriller"
        ],
        "review": " With his lover imprisoned in a Russian gulag, the Gray Man will stop at nothing to free her in this latest entry in the #1 New York Times bestselling series. A winter sunrise over the great plains of Russia is no cause for celebration. The temperature barely rises above zero, and the guards at Penal Colony IK22 are determined to take their misery out on the prisoners --- chief among them, one Zoya Zakharova. Once a master spy for Russian foreign intelligence, then the partner and lover of the Gray Man, she has information the Kremlin wants and they don't care what they have to do to get it. But if they think a thousand miles of frozen wasteland and the combined power of the Russian police state is enough to protect them, they don't know the Gray Man. He's coming, and no one's safe."
    },
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
]